[{"Name":"Better Than Sex Mascara","Brand":{"id":"2135","name":"Too Faced"},"Price":23,"Color":"Black","Description":"Take home our Better Than Sex mascara and all your desires for lush, incredibly intense lashes will be fulfilled. One application of our collagen-fueled formula and touch of our specially shaped brush will leave you begging for more. One coat and lashes are full, defined and stretched to unbelievable lengths. Two coats and they’re reaching unbelievable heights of drama. Three coats and you'll believe in magic.  1,944% more volume*, 100% saw longer lashes**, 100% saw dramatic volume**, 93% saw base-to-tip curl** 8 out of 10 say it's the best mascara they've ever used**, 3.4 out of 10 say great lashes are better than sex**, 3.1 out of 10 agree that this mascara is so good it's better than sex** *results observed in a clinical study **results observed in a consumer study Film-forming Polymer for smudge-proof, all day wear Acacia Senegal Tree Extract to nourish, thicken and lock curl in place Unique Peptides for the deepest, intense black possible Sulfate free, paraben free, and cruelty free. Web ID: 1032901 ","Image":"https://img.shopstyle-cdn.com/sim/b4/74/b474f137ebf621de733a9b2c892bb240_medium/too-faced-better-than-sex-mascara.jpg","Category":"Mascara"},{"Name":"Gimme Brow Volumizing Fiber gel","Brand":{"id":"33215","name":"Benefit Cosmetics"},"Price":24,"Color":"5 Deep - Dark brow to black (cool)","Description":"An award-winning, innovative brush-on gel containing tiny micro fibers that adhere to skin and hair, creating full, lush-looking brows where before there were none. The water resistant, long lasting, buildable formula locks hairs in place while conditioning with Vitamin B5 and marshmallow extract. Gimme brow builds easily for thick, full arches, thanks to a tapered brush for blending and a precision tip for shaping. Now available in 3 shades, including the NEW medium shade with warm undertones.  94% said brows looked visibly thicker* Beauty tip: Define brows with precisely, my brow pencil’s ultra-fine tip, then brush gimme brow volumizing fiber gel through hairs to tame, tint & volumize. Pair it with: Precisely, my brow pencil -- BROWVO! conditioning primer -- they’re real! lengthening mascara How to use: Using short pressing motions, stroke the precision tip along the brow to define & shape Brush through with the custom tiny tapered brush to blend and build Stroke on more to build thicker-looking brows To get the most natural look, start at the inner edge of your brow and move outward For the fullest, thickest-looking results, gently glide the brush against the direction of your hair growth starting at the tail, and allow the color to settle; then brush hairs back into place *Consumer panel survey of 66 women after 1 week Web ID: 2808901 ","Image":"https://img.shopstyle-cdn.com/sim/1b/6b/1b6bca7dc7d43cbc7bc1182b80222cea_medium/benefit-cosmetics-gimme-brow-volumizing-fiber-gel.jpg","Category":"Eye Makeup"},{"Name":"Lattice-Detail Racerback Bralette OB415612","Brand":{"id":"226","name":"Free People"},"Price":20,"Color":"Grey","Description":"This Free People racerback bra top pairs perfectly under this season's tops, featuring lattice detailing at back.  V-neckline Pullover style Spaghetti straps Lattice detail at racerback Hits at rib cage Nylon/spandex Machine washable Made in USA Web ID: 2226352 ","Image":"https://img.shopstyle-cdn.com/sim/0c/aa/0caa9cabfe2e56371a8d29e3ecd96d4f_medium/free-people-lattice-detail-racerback-bralette-ob415612.jpg","Category":"Sleeveless Tops"},{"Name":"Complexion Rescue Tinted Hydrating Gel Cream Broad Spectrum SPF 30","Brand":{"id":"17038","name":"bareMinerals"},"Price":29.5,"Color":"Wheat","Description":"The best of a BB, a CC, and a tinted moisturizer...with a 215% increase in skin hydration after just one week,* this is a whole new way to think about makeup.  *Based on average results on an independent U.S. clinical study of 62 participants. Powerful hydration: marine botanicals to help replenish thirsty skin. Mineral electrolytes to help energize skin. Dewy sheer-to-medium coverage for a radiant, soft, smooth finish. Non-chemical, mineral-based broad spectrum SPF 30. Heart-leaf globe daisy, an antioxidant, helps protect against environmental stressors. Available in 10 gorgeous shades: Opal 01 - For the fairest porcelain skin with cool tones. Vanilla 02 - For light skin with neutral tones. Buttercream 03 - For light skin with golden tones. Suede 04 - For medium skin with cool tones. Natural 05 - For medium skin with neutral tones. Ginger 06 - For medium skin with golden tones. Tan 07 - For tan skin with neutral tones. Spice 08 - For tan skin with golden tones. Chestnut 09 - For dark skin with golden tones. Sienna 10 - For deep skin with neutral tones. Web ID: 1849893 ","Image":"https://img.shopstyle-cdn.com/sim/7e/48/7e486a060f8041c27cafcc7b4fc847cc_medium/bareminerals-complexion-rescue-tinted-hydrating-gel-cream-broad-spectrum-spf-30.jpg","Category":"Face Care"},{"Name":"Tartelette In Bloom Clay Eyeshadow Palette","Brand":{"id":"2090","name":"Tarte"},"Price":46,"Color":"Wheat","Description":"Calling all firecrackers, flower children, activists and sweethearts! Discover 12 stunning new tartelette shadows to set your beauty routine into full bloom. With 9 mattes and 3 lusters, these lid liner and crease pairings allow you to create stunning, smoldering looks without the guesswork. Powered by tarte's signature Amazonian clay formula, you'll get the same pigmented payoff, blendability and weartime as the original tartelette - all in a chic, portable palette with a beautiful floral twist. Use your favorite shadow brush to create your own custom blended bold or more subtle looks suited for any occasion. It includes a mix of liner, lid and crease shadow shades and a step-by-step tartelette guide for creating smoldering, versatile looks that take you from \"sunflower stare\" to \"magic moonflower.\"  12 trendworthy shades: charmer (off white) jetsetter (warm taupe) rocker (shimmering taupe) smokeshow (black brown) flower child (peachy nude) smarty pants (tan) firecracker (bronze copper) activist (dark brown) funny girl (champagne) sweetheart (peach) rebel (chestnut brown) leader (aubergine) Web ID: 2623116 ","Image":"https://img.shopstyle-cdn.com/sim/86/f2/86f243f23284348a271fe58bcfce04cc_medium/tarte-tartelette-in-bloom-clay-eyeshadow-palette.jpg","Category":"Eye Makeup"},{"Name":"Cotton Scallop-Hem Shorts, Only at Macy's","Brand":{"id":"32346","name":"Maison Jules"},"Price":44.5,"Color":"Bright Whtie","Description":"Cute and trendy, these Maison Jules shorts are finished with a scalloped hem and ultra-short silhouette for style that keeps all eyes on you.  Mid rise; straight fit through hips and thighs Approx. inseam: 3\" Zipper and clasp closure at front Off-seam pockets; fke pockets at back with button detail Scallop hem Only at Macy's Cotton/spandex Machine washable Imported Web ID: 4497397 ","Image":"https://img.shopstyle-cdn.com/sim/e2/07/e207eac8cbbce724c8b799229174aa52_medium/maison-jules-cotton-scallop-hem-shorts-only-at-macys.jpg","Category":"Shorts"},{"Name":"TarteistTM PRO Palette","Brand":{"id":"2090","name":"Tarte"},"Price":53,"Color":"Bright Whtie","Description":"A pro-level, everyday eyeshadow palette with 20 ultra-pigmented shades powered by naturally-derived ingredients. Take a makeup artist home with this high-performance PRO palette for Instagram-worthy looks powered by healthy ingredients. It includes 16 longwearing matte eyeshadows infused with Amazonian clay for smooth blending and flake-resistant wear, plus four brand-new iridescent luster shades with a microshimmer, duochrome formula. Deeply concentrated mineral pigments and a new smart-blend technology give you the best in even, intense payoff in a range of natural artistryTM, neutral-to-bold shades for all skin tones and skill levels. This palette includes 20 eyeshadows:  Classic (cream) Innocent (soft peach) Whimsy (brick) Smoked (dark brown) Ethereal (bronze) Vintage (ivory) Fierce (cool plum) No filter (purple mauve) Vamp (deep plum) Glam (champagne) Chic (pale pink) Profesh (taupe) Mod (deep cherry) Drama (maroon) Minx (shimmering mauve) Indie (greige) Bold (light brown) Edgy (chocolate) Punk (black) Trendy (prismatic teal) Web ID: 3409146 ","Image":"https://img.shopstyle-cdn.com/sim/c2/0b/c20bb18cdc71bf709685c37fb1031ac3_medium/tarte-tarteisttm-pro-palette.jpg","Category":"Eye Makeup"},{"Name":"Sweet Peach Eye Shadow Palette","Brand":{"id":"2135","name":"Too Faced"},"Price":49,"Color":"Bright Whtie","Description":"A palette of 18 peach-scented eye shadows for limitless, timeless and modern looks. A new take on neutrals featuring fresh-picked shades of peachy pinks, corals and bronzes, along with pops of purples that will have you looking sweet as a peach year-round.  Infused with the skin-loving essence of peach Rich, pigmented shadows offer true color payoff Complementary for all skin tones How to use: Use one of the matte, neutral shades to softly define the brows Use with Sweet Peach Creamy Lip Oil, Sweet Peach Glow Highlighting Palette, Better Than Sex Mascara Imported Web ID: 4393318 ","Image":"https://img.shopstyle-cdn.com/sim/74/68/7468d64f1184a67bd23c0f819b3d7695_medium/too-faced-sweet-peach-eye-shadow-palette.jpg","Category":"Eye Makeup"},{"Name":"Naked Basics Eyeshadow Palette","Brand":{"id":"3501","name":"Urban Decay"},"Price":29,"Color":"Bright Whtie","Description":"Our first MATTE palette, featuring six gorgeously Naked neutrals to build on or wear alone--including four never-before-seen shades. Naked Basics is more than just the long-awaited, multipurpose MATTE companion to Naked. It's the palette EVERY woman needs in her beauty arsenal. With six stripped-down, Nakedly neutral shadows, it has everything you need for the perfect neutral matte eye--including four totally new and exclusive shades. Use these shadows to contour, line and highlight to create the right amount of definition for any occasion. Or for the days when you're craving more color, pair them with your fiercest, boldest shadows. Richer than other mattes, the color goes on with a smooth, luxe finish (never chalky or powdery). There's even one demi-matte shade, Venus, which has the tiniest touch of satin--perfect for highlighting and adding dimension.  Shade descriptions: Venus (soft, off-white demi-matte), Foxy (cream bisque matte), Walk of Shame (very light nude matte), Naked2 (taupe matte), Faint (warm, dusty brown matte) and Crave (deepest, darkest brown/black matte). Web ID: 776154 ","Image":"https://img.shopstyle-cdn.com/sim/cb/0a/cb0a61b60ddfe276b60f7adba6faa0b5_medium/urban-decay-naked-basics-eyeshadow-palette.jpg","Category":"Eye Shadow"},{"Name":"Seersucker Off-The-Shoulder Dress, Only at Macy's","Brand":{"id":"32346","name":"Maison Jules"},"Price":69.5,"Color":"Soft Shell Combo","Description":"An off-the-shoulder sensation, Maison Jules' seersucker dress is saturated with style.  CLOSURE Hits above knee Straight neckline Short sleeves; off-the-shoulder design Seersucker texture Only at Macy's Cotton/polyester; lining: polyester Machine washable Imported Web ID: 4519750 ","Image":"https://img.shopstyle-cdn.com/sim/dd/80/dd80b9a48446943c0955a598476cda09_medium/maison-jules-seersucker-off-the-shoulder-dress-only-at-macys.jpg","Category":"Cocktail Dresses"},{"Name":"Flounce Pom-Pom Off-The-Shoulder Top, a Macy's Exclusive Style","Brand":{"id":"14892","name":"Kensie"},"Price":49,"Color":"Rosey Nude","Description":"A stylish off-the-shoulder silhouette meets a fun pom-pom hem in this sweet flounce top from kensie.  Off-the-shoulder neckline with overlay Pom-pom trim hem Hits at hip A Macy's exclusive style Polyester/spandex Hand wash Imported Web ID: 4637557 ","Image":"https://img.shopstyle-cdn.com/sim/bb/6e/bb6eff96f9db2b8c7199d3ebe6857f74_medium/kensie-flounce-pom-pom-off-the-shoulder-top-a-macys-exclusive-style.jpg","Category":"Shortsleeve Tops"},{"Name":"Keley Two-Piece Flat Sandals, Only at Macy's","Brand":{"id":"25","name":"American Rag"},"Price":39.5,"Color":"Rust","Description":"American Rag's Keley sandals dress up or down with an understated sophistication fashioned in a single wide ankle strap and subtle profile.  Round-toe ankle-strap sandals Zipper closure at back Only at Macy's Manmade upper; manmade sole Imported Web ID: 4589370 ","Image":"https://img.shopstyle-cdn.com/sim/a8/0b/a80b3bce18a7edb331caa701d9942da6_medium/american-rag-keley-two-piece-flat-sandals-only-at-macys.jpg","Category":"Sandals"},{"Name":"Pop of Passion Lip Oil-Balm","Brand":{"id":"17038","name":"bareMinerals"},"Price":16,"Color":"Tangerine Pop","Description":"Drench your pout in decadent hydration and plush, passionate color. This oil-rich formula delivers luscious color and slick shine with a comfortable color-stain. Melt-in moisture provides hydration while passion fruit seed oil with vitamin E helps nourish.  Luscious color + slick shine Melt-in moisture Comfortable color-satin Passion fruit seed oil with Vitamin E Pop of Passion Lip Oil-Balm in Pink Passion (youthful pink), 0.11 oz Pop of Passion Lip Oil-Balm in Nude Passion (caramel buff), 0.11 oz Pop of Passion Lip Oil-Balm in Peach Passion (fresh peach), 0.11 oz Pop of Passion Lip Oil-Balm in Rose Passion (deep blush), 0.11 oz Pop of Passion Lip Oil-Balm in Candy Pop (neon pink), 0.11 oz Pop of Passion Lip Oil-Balm in Tangerine Pop (juicy citrus), 0.11 oz Pop of Passion Lip Oil-Balm in Punch Pop (vivid watermelon), 0.11 oz Pop of Passion Lip Oil-Balm in Plumberry Pop (pink plum), 0.11 oz Web ID: 1847119 ","Image":"https://img.shopstyle-cdn.com/sim/e4/96/e4967364cee35adef2fd5ce6c7b99273_medium/bareminerals-pop-of-passion-lip-oil-balm.jpg","Category":"Lip Products"},{"Name":"Three-Quarter-Sleeve Blazer","Brand":{"id":"14892","name":"Kensie"},"Price":89,"Color":"Black","Description":"A chic staple, this kensie fitted blazer is perfect for layering on pretty, polished style!  Long sleeves, can uncuff Notched lapel Single button closure at front center Two front welt pockets Fitted Lined Hits at the hip, approx. 24 inches from center-back In slate, a Macy's exclusive color Shell: Polyester/rayon/spandex; lining: polyester Dry clean Imported Web ID: 1841893 ","Image":"https://img.shopstyle-cdn.com/sim/90/27/902738a68b82545bf501c1c3bce00569_medium/kensie-three-quarter-sleeve-blazer.jpg","Category":"Blazers"},{"Name":"Retana Lace-Up Demi-Wedge Sandals","Brand":{"id":"616","name":"Vince Camuto"},"Price":119,"Color":"Tumbleweed","Description":"Vince Camuto's Retana sandals add chic intrigue to any look with striking perforations meeting a ghillie lace design and sleek demi-wedge heel.  Round-toe lace-up demi-wedge sandals Ghillie lace design; perforated pattern at upper 1-1/2\" demi-wedge heel Suede upper; manmade sole Imported Web ID: 4505177 ","Image":"https://img.shopstyle-cdn.com/sim/dd/44/dd44bbe1b6f28b95c4e33870615a91bf_medium/vince-camuto-retana-lace-up-demi-wedge-sandals.jpg","Category":"Wedges"},{"Name":"Popsicle® Off-The-Shoulder Top, Only at Macy's","Brand":{"id":"273","name":"INC International Concepts"},"Price":49.5,"Color":"Magenta Flame","Description":"Cute little pom-poms trim this playful top from INC International Concepts, complete with a stylish off-the-shoulder neckline.  Off-the-shoulder neckline Pom-pom trim at cuffs and hem Hits at hip Only at Macy's Body: rayon; trim: nylon Machine washable Imported Web ID: 4549800 ","Image":"https://img.shopstyle-cdn.com/sim/ec/9b/ec9b69dfde3926b3f55d942d4477bf7e_medium/inc-international-concepts-popsicle-off-the-shoulder-top-only-at-macys.jpg","Category":"Shortsleeve Tops"},{"Name":"Easten Slide Sandals, Only at Macy's","Brand":{"id":"25","name":"American Rag"},"Price":39.5,"Color":"Tan/Gold","Description":"Whether on exotic travels or close to home, the simple double-strap design of American Rag's Easten slides graces your look with effortless style.  Round-toe slip-on slide sandals 1\" heel Only at Macy's Manmade upper; manmade sole Imported Web ID: 4589372 ","Image":"https://img.shopstyle-cdn.com/sim/87/ac/87ac2f4230784e4945e790f1e334a070_medium/american-rag-easten-slide-sandals-only-at-macys.jpg","Category":"Sandals"},{"Name":"Off-The-Shoulder Top, Only at Macy's","Brand":{"id":"273","name":"INC International Concepts"},"Price":69.5,"Color":"Lucky Lemon","Description":"A charming lemon print decorates this playful top from INC International Concepts, finished with a fabulous off-the-shoulder silhouette.  Off-the-shoulder neckline Easy fit; hits at hip Only at Macy's Polyester Machine washable Imported Web ID: 4587763 ","Image":"https://img.shopstyle-cdn.com/sim/fe/89/fe892824a216c1753aa900f90c046eb0_medium/inc-international-concepts-off-the-shoulder-top-only-at-macys.jpg","Category":"Longsleeve Tops"},{"Name":"Crocheted Lace Top, Only at Macy's","Brand":{"id":"273","name":"INC International Concepts"},"Price":79.5,"Color":"Bright White","Description":"A crocheted lace overlay gives an artfully stylish vibe to this sleeveless top from INC International Concepts.  Crew neckline; back keyhole button closure Allover crocheted lace Hits at hip Only at Macy's Cotton; lining: polyester Machine washable Imported Web ID: 4565990 ","Image":"https://img.shopstyle-cdn.com/sim/ba/00/ba00966d26d7d5cdbab01660fbd1aad5_medium/inc-international-concepts-crocheted-lace-top-only-at-macys.jpg","Category":"Sleeveless Tops"},{"Name":"Kari Slide Flat Sandals","Brand":{"id":"2635","name":"UGG"},"Price":110,"Color":"Silver","Description":"Ultra-comfortable with a stylish lift, these Kari sandals by UGG® combine wide crisscross straps and an eye-catching platform design.  Round-toe slip-on crisscross platform sandals Imprint by UGGTM leather-lined insole; embossed UGG® logo on heel Treadlite by UGGTM with rubber toe and heel for added lightweight traction, cushioning, flexibility and durability Vegetable-tanned leather 1/4\" platform Leather upper; rubber sole Imported Web ID: 3049037 ","Image":"https://img.shopstyle-cdn.com/sim/34/3f/343f7fa4bdc1ce16f30e9d151a69b79d_medium/ugg-kari-slide-flat-sandals.jpg","Category":"Sandals"},{"Name":"Elaine Embroidered Maxi Dress","Brand":{"id":"226","name":"Free People"},"Price":118,"Color":"Navy","Description":"Embody sheer effortlessness in this breezy maxi dress from Free People.  Ties at back Hits at ankle Scoop neckline; shift silhouette Short tiered flutter sleeves Racerback style; embroidered at skirt Unlined Viscose Machine washable Imported Web ID: 4564045 ","Image":"https://img.shopstyle-cdn.com/sim/6e/2f/6e2f32b48516ad0b0e7825c62ca28f65_medium/free-people-elaine-embroidered-maxi-dress.jpg","Category":"Day Dresses"},{"Name":"Krista T-Strap Flat Sandals, Only at Macy's","Brand":{"id":"25","name":"American Rag"},"Price":29.5,"Color":"White","Description":"These barely-there sandals are the perfect go-to style. The Krista t-strap flat sandals by American Rag.  Man-made upper Round open-toe t-strap flat sandals with buckle closure Man-made sole Imported Web ID: 2349924 ","Image":"https://img.shopstyle-cdn.com/sim/de/34/de34ac120c088199a9c433604b6b4890_medium/american-rag-krista-t-strap-flat-sandals-only-at-macys.jpg","Category":"Sandals"},{"Name":"All I Got Printed Maxi Dress","Brand":{"id":"226","name":"Free People"},"Price":168,"Color":"Red Combo","Description":"Make a lasting impression in this gorgeous midi dress from Free People.  Ties at waist Hits above ankle Plunging V-neckline; A-line silhouette Polyester Machine washable Imported Web ID: 4375490 ","Image":"https://img.shopstyle-cdn.com/sim/22/0c/220c04a11a32f2901bbb2c4466484f28_medium/free-people-all-i-got-printed-maxi-dress.jpg","Category":"Day Dresses"},{"Name":"NYX Professional Makeup Two Timer Eyeliner","Price":10,"Color":"JET BLACK","Description":"Having it all is possible with this incredibly edgy new makeup weapon from NYX Professional Makeup, which makes two of the most popular formulas of eyeliner available in one convenient tool. The combination of the precision of liquid liner with the ease of application of an eye crayon is the perfect match to create a variety of dramatic looks. When the cat eye meets the smoldering intensity of a smoky eye look, who knows where the night will take you?  This dual-ended eyeliner includes both liquid eyeliner and kohl kajal liner The kohl kajal liner is formulated to be used on the waterline if desired How to use: Apply to upper and lower lash line Use alone as a liquid liner, kohl liner or both together for a smoldering look Web ID: 3324571 ","Image":"https://img.shopstyle-cdn.com/sim/78/08/7808bb1b1d2a0c3b37b2263c769a6a88_medium/nyx-professional-makeup-two-timer-eyeliner.jpg","Category":"Eyeliner"},{"Name":"Seanna Flat Sandals","Brand":{"id":"616","name":"Vince Camuto"},"Price":110,"Color":"Taupe","Description":"A knotted and woven T-strap adds a hint of humble huarache style to a chic gladiator look in Vince Camuto's Seanna demi-wedge sandals.  Round-toe T-strap gladiator thong sandals Zipper closure at back; woven detail at T-strap 1\" demi-wedge heel Suede upper; manmade sole Imported Web ID: 4603016 ","Image":"https://img.shopstyle-cdn.com/sim/02/63/0263aa6c21ed371a00c32c34c26c726d_medium/vince-camuto-seanna-flat-sandals.jpg","Category":"Sandals"},{"Name":"bareSkin® Complete Coverage Serum Concealer","Brand":{"id":"17038","name":"bareMinerals"},"Price":21,"Color":"Tan","Description":"A silky smooth complete coverage concealer and serum in one. Designed to provide remarkable coverage with an ultra-light texture, bareSkin® Complete Coverage Serum Concealer instantly covers the appearance of dark circles, discoloration and other imperfections for a beautifully even-toned complexion. Formulated with antioxidant Lilac Plant Stem Cells, this multi-tasking concealer features high-definition mineral optics to counteract shadows and give skin a brightened, lustrous finish. Hydrating humectants to help nourish the under-eye area, while the silky smooth texture glides effortlessly over fine lines, leaving skin looking fresh and flawless all day.  Mineral-coated optical pigments to help brighten and diffuse the appearance of dark circles and imperfections. Formulated with antioxidant Lilac Plant Stem Cells Hydrating humectants to help nourish the delicate under-eye area Silky smooth application layers beautifully over or under foundation Web ID: 2349528 ","Image":"https://img.shopstyle-cdn.com/sim/41/aa/41aa3874bd575e7c0a77ca919f18ba44_medium/bareminerals-bareskin-complete-coverage-serum-concealer.jpg","Category":"Beauty Products"},{"Name":"Jacon Two-Piece Cylinder-Heel Sandals","Brand":{"id":"616","name":"Vince Camuto"},"Price":110,"Color":"Tribal Red","Description":"Vince Camuto combines runway-ready fashion and chic minimalism in the Jacon sandals, featuring a cylindrical heel.  Almond-toe sandals with ankle strap and Velcro® closure 3\" cylinder heel Leather upper; manmade sole Imported Web ID: 4506890 ","Image":"https://img.shopstyle-cdn.com/sim/cb/a9/cba9890bdfa0117617659251c821712c_medium/vince-camuto-jacon-two-piece-cylinder-heel-sandals.jpg","Category":"Sandals"},{"Name":"Women's Superstar Casual Sneakers from Finish Line","Brand":{"id":"14","name":"adidas"},"Price":79.99,"Color":"WHITE/CORE BLACK/WHITE","Description":"The adidas Superstar was introduced in 1969 as the first low-top basketball sneaker to feature an all-leather upper and the now famous rubber shell toe. Retro and modern at the same time, these sneakers are sure to be a hit all year long.  Classic basketball style Runs large; order next size down Court classics Famous rubber shell toe Retro style Style no. C77153 Women's athletic footwear from Finish Line Leather upper; rubber outsole Imported Web ID: 2163613 ","Image":"https://img.shopstyle-cdn.com/sim/12/17/121728c8884f0782c7e11e223087858c_medium/adidas-womens-superstar-casual-sneakers-from-finish-line.jpg","Category":"Sneakers"},{"Name":"PowerGlow Peel 1 Minute 1-Step Exfoliating Facial Peel – 10 Treatments","Brand":{"id":"33531","name":"M-61 by Bluemercury"},"Price":28,"Color":"None","Description":"This quick glycolic and salicylic acid exfoliating peel with vitamin K, bilberry and chamomile helps to resurface, clarify and firm the skin, visibly reducing the appearance of pores and fine lines, improving skin’s tone and texture and providing instant radiance. Recommended for clients experiencing hyperpigmentation, breakouts and/or dull, dry or aging skin.  Gently move over face and neck while avoiding eye area. Do not rinse off. Recommend starting 3 times a week and building up to every day 100% paraben-free 100% synthetic fragrance-free Dermatologist tested Allergy tested Vegan Glycolic and salicylic acid help reduce pore size, reduce the appearance of fine lines, and improve the skin’s tone, texture and clarity Vitamin K helps to reduce the appearance of spider veins and combats dry, rosacea-like patches Antioxidant bilberry extract helps promote an even skin tone, while chamomile and lavender assist in calming and soothing irritation; 10 Treatments Made in USA Web ID: 2709642 ","Image":"https://img.shopstyle-cdn.com/sim/4f/9d/4f9d8d4c4a485c0ec1cbb3c4fe897ffa_medium/m-61-by-bluemercury-powerglow-peel-1-minute-1-step-exfoliating-facial-peel-10-treatments.jpg","Category":"Face Scrubs & Exfoliants"},{"Name":"Floral-Print Off-The-Shoulder Dress","Brand":{"id":"31658","name":"J.o.a."},"Price":95,"Color":"Navy Multi","Description":"Gorgeous and carefree, J.O.A.'s dress has ruffled short sleeves that drop attractively off each shoulder, creating a charming off-the-shoulder neckline.  Zipper closure at back Short length Off-the-shoulder neckline; fitted silhouette Short ruffle sleeves Linen; lining: rayon Hand wash Imported Web ID: 4546826 ","Image":"https://img.shopstyle-cdn.com/sim/38/d8/38d843840632a6be0f367920a1b92b12_medium/j-o-a-floral-print-off-the-shoulder-dress.jpg","Category":"Day Dresses"},{"Name":"Gia Tie-Up Sandals","Brand":{"id":"107","name":"Carlos by Carlos Santana"},"Price":59,"Color":"Sand beige","Description":"The elegant wrapping ankle-tie design of Carlos by Carlos Santana's Gia sandals is dotted in lively pom poms for a look primed for weekend festival fun.  Round-toe lace-up ankle-tie gladiator sandals Wrapping ankle tie and ghillie lace design; pom pom accents at straps; cushioned insole for added comfort Microsuede fabric upper; manmade sole Imported Web ID: 4363108 ","Image":"https://img.shopstyle-cdn.com/sim/c8/a3/c8a36373bdb52016e50569dfca76a533_medium/carlos-by-carlos-santana-gia-tie-up-sandals.jpg","Category":"Sandals"},{"Name":"Style & Co Denim Skirt, Only at Macy's","Brand":{"id":"558","name":"Style&Co."},"Price":49.5,"Color":"White","Description":"Style&co.'s denim skirt is the perfect addition to your wardrobe! Pair it with wedges or sandals for a chic look.  Front button closure with zipper fly Straight silhouette Five-pocket style; belt loops Dark wash denim with contrast top stitching Hits at knee; approx. 22\" Generous sizing; if in-between sizes, consider sizing down Only at Macy's Cotton/polyester/spandex Machine washable Imported Web ID: 4803988 ","Image":"https://img.shopstyle-cdn.com/sim/6d/89/6d89cce8562207c4051abc7cfa697586_medium/style-co-style-co-denim-skirt-only-at-macys.jpg","Category":"Mid-length Skirts"},{"Name":"they're real! lengthening mascara","Brand":{"id":"33215","name":"Benefit Cosmetics"},"Price":24,"Color":"beyond brown","Description":"They're real! lengthens, curls, volumizes, lifts & separates. Our jet black, long-wearing formula won’t smudge or dry out. A specially designed brush reveals lashes you never knew you had!  94% saw dramatic length & volume* 90% saw base-to-tip curl* 94% saw visible lift* 100% saw long-wearing results* *Results observed in a consumer panel survey How to use: Position wand horizontally & wiggle brush from side to side, base to tip, to achieve maximum volume, length & lift. Hold wand vertically & stroke upward to curl & separate. Layer generously as desired. Beauty Tip: Want a big, doe-eyed look? Fan corner lashes outward with the custom-domed tip. The precision bristles make it easy! Web ID: 574339 ","Image":"https://img.shopstyle-cdn.com/sim/19/1f/191fc53803368b04c312c00150cb32dd_medium/benefit-cosmetics-theyre-real-lengthening-mascara.jpg","Category":"Mascara"},{"Name":"Boom Sneakers","Brand":{"id":"75","name":"Betsey Johnson"},"Price":69,"Color":"White","Description":"The clean Boom sneakers from Betsey Johnson are a staple for fashionistas who do a lot of walking at work or off-hours.  Round-toe sneakers with lace-up closure Manmade upper; manmade sole Imported Web ID: 4400008 ","Image":"https://img.shopstyle-cdn.com/sim/e9/00/e900a559514bc3d33bf83c118d0f9c88_medium/betsey-johnson-boom-sneakers.jpg","Category":"Sneakers"},{"Name":"Be Legendary Liquid Lip – Liquid Metal","Brand":{"id":"2009","name":"Smashbox"},"Price":24,"Color":"Space Case","Description":"A liquid lip formula in a mirror-like metallic finish that glides on maxed-out color in a single coat. Smashbox's pro artists maxed out the metallic shine in each formula with punched-up pigments and four levels of pearls that capture and reflect light from every angle. The result? A magic trick of light that makes lips look fuller in any light and every pic.  Metallic finish Delivers one-coat rich, saturated color Makes lips appear more plump and full Feels soft and comfortable on lips; non-gritty Foolproof cone-shaped applicator distributes product evenly Formulated without parabens, sodium lauryl sulfate, phthalates, silicone, oil and talc How to use: Line lips with precision tip and then fill in Web ID: 4582790 ","Image":"https://img.shopstyle-cdn.com/sim/31/ce/31ceaf644b5f2022f10cfbdb7470cbcd_medium/smashbox-be-legendary-liquid-lip-liquid-metal.jpg","Category":"Lip Gloss"},{"Name":"Solo Bradford Slim Laptop Briefcase","Price":120,"Color":"Black","Description":"This Bradford briefcase from Solo goes out of its way to make life easy. On the outside, there's room to keep essentials at your fingertips. Inside, the slim case protects your laptop and tablet.  Dimensions: 16\" x 12\" x 3\" Interior features: padded compartment for up to a 15.6\" laptop; tablet pocket; file organizer section Exterior features: carrying handles; adjustable, removable strap; front zip-down organizer section; rear accessory pocket Weight: 2.18 lbs Manufacturer's 5-year limited warranty Wipe clean Imported Web ID: 2546420 ","Image":"https://img.shopstyle-cdn.com/sim/3d/0b/3d0b2936073e34dbdd70ebf6bec4e370_medium/solo-bradford-slim-laptop-briefcase.jpg","Category":"Bags"},{"Name":"Modern Renaissance Eye Shadow Palette","Brand":{"id":"4096","name":"Anastasia Beverly Hills"},"Price":42,"Color":"Modern Renaissance","Description":"An essential eye shadow collection with fourteen shades, including neutral and berry tones.  Available in 14 shades: TEMPERA: velvety beige with an ultra-matte finish GOLDEN OCHRE: earthy yellow with an ultra-matte finish VERMEER: iridescent shell with a metallic finish BUON FRESCO: antique lavender with an ultra-matte finish ANTIQUE BRONZE: metallic sable with a satin finish LOVE LETTER: raspberry with an ultra-matte finish CYPRUS UMBER: dark coffee with an ultra-matte finish RAW SIENNA: neutral amber with an ultra-matte finish BURNT ORANGE: deep orange with an ultra-matte finish PRIMAVERA: shimmery gold dust with a metallic finish RED OCHRE: sienna with an ultra-matte finish VENETIAN RED: crimson with an ultra-matte finish WARM TAUPE: earthy gray with an ultra-matte finish REALGAR: brick with an ultra-matte finish Web ID: 2839521 ","Image":"https://img.shopstyle-cdn.com/sim/83/9a/839a3c243e404490c8064c479a8abb8d_medium/anastasia-beverly-hills-modern-renaissance-eye-shadow-palette.jpg","Category":"Eye Shadow"},{"Name":"Hot Tropics Printed Jumpsuit","Brand":{"id":"226","name":"Free People"},"Price":128,"Color":"Pink Combo","Description":"Enjoy fashionable style every time you sport this breezy jumpsuit from Free People. Tie detailing at waist gives it shape while adjustable spaghetti straps allow you to tailor the fit.  V-neckline Adjustable spaghetti straps Button closure at front; ties at waist Off-seam pockets; one patch pocket at back Relaxed fit through hips and thighs Wide leg is cropped above ankle Approx. inseam: 21\" Shell: viscose; lining: viscose Hand wash Imported Web ID: 4650106 ","Image":"https://img.shopstyle-cdn.com/sim/46/65/4665e224aa7f22c95f2f00adf0a574a5_medium/free-people-hot-tropics-printed-jumpsuit.jpg","Category":"Wide Leg Pants"},{"Name":"watt's up!\" cream-to-powder highlighter","Brand":{"id":"33215","name":"Benefit Cosmetics"},"Price":30,"Color":"champagne glow","Description":"Benefit's soft focus highlighter turns on \"watt\" ya got with a delicate champagne glow that's gorgeous. With a cream-to-powder finish...it's a switch on \"wow\" for all complexions. You'll adore the smooth applicator & luminous sheen.  Directions: Glide on cheek & brow bones...then sculpt with its soft glow blender for YOUR perfect gleam. Can be applied solo or over existing makeup. Web ID: 604049 ","Image":"https://img.shopstyle-cdn.com/sim/7f/11/7f1144bea5589a45c35b33ec62c62183_medium/benefit-cosmetics-watts-up-cream-to-powder-highlighter.jpg","Category":"Face Makeup"},{"Name":"Style & Co Clean Cut Reversible Crossbody Tote, Only at Macy's","Brand":{"id":"558","name":"Style&Co."},"Price":88.5,"Color":"Red/Tan","Description":"Add the appropriate pop of color with a reversible, versatile crossbody shopper in modern colorblocking, from Style & Co.  16\"W x 13\"H x 4-5/8\"D 5\"L double handles; 15-1/4\" to 24\"L adjustable crossbody strap Magnetic snap closure Exterior features silver-tone hardware Bag reverses easily by turning inside out and flipping the inside bottom panel. When reversed, seams turn inside with strap hooks on the outside. Silhouette is based off 5'9\" model Only at Macy's Faux leather Imported Web ID: 3052705 ","Image":"https://img.shopstyle-cdn.com/sim/9c/f1/9cf1c63e08af1108463331663d227c8f_medium/style-co-style-co-clean-cut-reversible-crossbody-tote-only-at-macys.jpg","Category":"Duffels & Totes"},{"Name":"Bronze Shimmer Brick Compact","Brand":{"id":"834","name":"Bobbi Brown"},"Price":48,"Color":"Red/Tan","Description":"The original Shimmer Brick Compact. This shimmering, brush-on powder creates a deep, bronzy glow. Sweep on cheeks, after Blush, using the Face Blender Brush. Works well with neutral and deep blush shades.  Web ID: 393041 ","Image":"https://img.shopstyle-cdn.com/sim/66/a1/66a1a0399ae1aeab3e0036aa066a4437_medium/bobbi-brown-bronze-shimmer-brick-compact.jpg","Category":"Face Bronzer"},{"Name":"Printed Off-The-Shoulder Top","Brand":{"id":"1244","name":"GUESS"},"Price":59,"Color":"Frida Floral Jet Black","Description":"GUESS achieves a modern Boho look with vivacious off-the-shoulder detailing featuring zigzag embroidery along the neckline. Peppy ruffles give each sleeve a tiered silhouette.  Off-the-shoulder neckline Zigzzag embroidery at neckline Short sleeves with double ruffles Loose fit; hits at waist Polyester Machine washable Imported Web ID: 4488697 ","Image":"https://img.shopstyle-cdn.com/sim/9c/2c/9c2c5044bb5b975689a80e4f037b46a8_medium/guess-printed-off-the-shoulder-top.jpg","Category":"Teen Girls' Tops"},{"Name":"Pineapple Small Crossbody","Brand":{"id":"75","name":"Betsey Johnson"},"Price":88,"Color":"Yellow","Description":"Fun and fruity, Betsey Johnson's tropical crossbody punches up your outfit and can be carried as a sweet wristlet.  Straw; trim: faux leather Small sized bag; 8-1/2\"W x 7\"H x 2\"D Silhouette is based off 5'9\" model 7\"L detachable wristlet strap; 24\"L crossbody strap Turn-lock closure Gold-tone exterior hardware 1 interior slip pocket Imported Web ID: 4558418 ","Image":"https://img.shopstyle-cdn.com/sim/2d/04/2d04c8cd71dafcbb271bd2a0346025d6_medium/betsey-johnson-pineapple-small-crossbody.jpg","Category":"Shoulder Bags"},{"Name":"Chuck Taylor Shoreline Casual Sneakers from Finish Line","Brand":{"id":"144","name":"Converse"},"Price":54.99,"Color":"GREEN GLOW","Description":"When you need a pair of shoes that you can quickly slip on, the Chuck Taylor Shoreline Ox Casual sneakers have the same awesome look as the original Chuck Taylor's, except have the convenience of being a slip-ons.  Slip-on style All Star branding Style no. 556690F Women's athletic sneakers from Finish Line Canvas upper; rubber sole Imported Web ID: 4488571 ","Image":"https://img.shopstyle-cdn.com/sim/0c/19/0c19b2f0a8190daa9f14cd8d617a64a7_medium/converse-chuck-taylor-shoreline-casual-sneakers-from-finish-line.jpg","Category":"Sneakers"},{"Name":"Love Lane Striped Knot T-Shirt","Brand":{"id":"226","name":"Free People"},"Price":68,"Color":"Grey Combo","Description":"Sweet stripes and a flirty shoulder-baring design take this Free People T-shirt from ordinary to fashionable, with a loose, drapey fit and cute tie knot at hem.  Off-the-shoulder neckline; pullover style Knot at hem Easy fit; hits at hip Polyester/cotton/rayon Hand wash Imported Web ID: 4571133 ","Image":"https://img.shopstyle-cdn.com/sim/df/b8/dfb8bf14ae723fa5fb92c138e60a193a_medium/free-people-love-lane-striped-knot-t-shirt.jpg","Category":"Tees"},{"Name":"Cotton Eyelet Lattice-Back Crop Top","Brand":{"id":"31658","name":"J.o.a."},"Price":72,"Color":"Off White","Description":"J.O.A. fills this flutter-sleeve top with sweet details from eyelet embroidery to ladder trim. A lace-up back and midriff-baring cropped hem are sexy touches.  Crew neckline Eyelet embroidery throughout; crisscross straps across wide opening at back; ladder trim at front Short flutter sleeves Fitted; hits at waist All cotton Machine washable Imported Web ID: 4546847 ","Image":"https://img.shopstyle-cdn.com/sim/97/68/97686748f55644957c56e0f0a6045eb5_medium/j-o-a-cotton-eyelet-lattice-back-crop-top.jpg","Category":"Shortsleeve Tops"},{"Name":"NYX Professional Makeup Honey Dew Me Up Primer","Price":17,"Color":"Off White","Description":"Inspired by honey's golden glow, we developed a primer that neutralizes the appearance of discoloration and redness. Our innovative light reflective gold flecks create a luminous look that will help keep your skin looking radiant all day.  A gel primer infused with honey, gold flecks, and collagen Preps and primes face for make-up application How to use: This primer is loaded with beneficial ingredients for your skin Honey is natural antiseptic, while the gold flecks increase skin radiance, and collagen strengthens skin Web ID: 3324592 ","Image":"https://img.shopstyle-cdn.com/sim/ae/65/ae651e120abc1d1686b8029e670f40ae_medium/nyx-professional-makeup-honey-dew-me-up-primer.jpg","Category":"Makeup"},{"Name":"August Hats Watermelon Floppy Hat","Price":36,"Color":"Pink Mix","Description":"Freshen up your sea-faring style with a cheeky watermelon-brim sun hat from August Hats.  Watermelon brim; UPF 50+ Circumference measures approximately 22-4/10\" One size fits all Paper Spot clean only Imported Web ID: 4369159 ","Image":"https://img.shopstyle-cdn.com/sim/96/73/9673ca42e055dc83759fe974dbd3c6eb_medium/august-hats-watermelon-floppy-hat.jpg","Category":"Hats"},{"Name":"bareSkin Perfecting Veil, 0.3 oz","Brand":{"id":"17038","name":"bareMinerals"},"Price":26,"Color":"Tan to Dark","Description":"This utterly weightless finishing powder is formulated with light-reflecting optics to help diffuse the look or appearance of fine lines, Lilac Plant Stems Cells and Vitamin C to help brighten your complexion and a special blend of minerals to absorb excess oil and balance skin texture.  Benefits: Special blend of minerals helps to absorb excess oil with a soft focus finish. Light-reflective optics soften the look of fine lines and wrinkles and blur the appearance of pores. Vitamin C helps to visibly brighten the complexion. Web ID: 1644266 ","Image":"https://img.shopstyle-cdn.com/sim/48/5c/485c794111d0b18024d6edd43ba32780_medium/bareminerals-bareskin-perfecting-veil-0-3-oz.jpg","Category":"Makeup"},{"Name":"1.STATE Printed V-Neck Dress","Brand":{"id":"31426","name":"1 STATE"},"Price":109,"Color":"Yellow","Description":"So effortless and simple to wear and pair, this sleeveless 1.STATE dress is complete with a V-neckline and a breathable silhouette that flatters any shape.  Pullover style Short length V-neckline; shift silhouette Shell:rayon; lining:polyester Machine washable Imported Web ID: 4675293 ","Image":"https://img.shopstyle-cdn.com/sim/0a/1f/0a1fa348356864885ebdce9e80eefaf5_medium/1-state-1-state-printed-v-neck-dress.jpg","Category":"Day Dresses"},{"Name":"Denim Bermuda Shorts","Brand":{"id":"104","name":"Calvin Klein Jeans"},"Price":59.5,"Color":"White Light","Description":"Calvin Klein Jean's Bermuda shorts capture that casual attitude you can tailor to your wardrobe.  Mid rise; skinny fit through hips and thighs Approx. inseam: 9” Zipper and button closure; belt loops Classic five-pocket styling Light wash with whiskers and fading Denim wash-Cotton/polyester/viscose/spandex White wash-Cotton/spandex Machine washable Imported Web ID: 3322804 ","Image":"https://img.shopstyle-cdn.com/sim/aa/99/aa994ad24116458a4d0db59d6bc07d6a_medium/calvin-klein-jeans-denim-bermuda-shorts.jpg","Category":"Shorts"},{"Name":"Juniors' Striped Side-Cutout Romper","Brand":{"id":"634","name":"XOXO"},"Price":69,"Color":"Indigo/Ivory","Description":"XOXO's sleeveless romper, detailed with racerback styling and waist cutouts, makes a fashion statement in of-the-moment banker stripes.  V-neckline Sleeveless; racerback styling Back zipper closure Cutouts at waist Allover stripe print Two side pockets Fitted silhouette Approximate inseam: 3\" Linen/cotton/rayon Machine washable Imported Web ID: 4518424 ","Image":"https://img.shopstyle-cdn.com/sim/8f/2b/8f2b0332e6ff4805f230fe778baa3b32_medium/xoxo-juniors-striped-side-cutout-romper.jpg","Category":"Teen Girls' Shorts"},{"Name":"Rock With It Off-The-Shoulder Top","Brand":{"id":"226","name":"Free People"},"Price":88,"Color":"Ivory","Description":"Free People's Rock With It top has sensational balloon sleeves dropping from an alluring off-the-shoulder neckline. Boho-chic embroidery adds chic embellishment.  Off-the-shoulder neckline 3/4 balloon sleeves with embroidered mesh insets Hits at hip Rayon/spandex Machine washable Imported Web ID: 4570435 ","Image":"https://img.shopstyle-cdn.com/sim/60/02/60028085687f1e914a059cdb7ce4b890_medium/free-people-rock-with-it-off-the-shoulder-top.jpg","Category":"Longsleeve Tops"},{"Name":"READY Luminizer Duo: The Love Affair & The Shining Moment","Brand":{"id":"17038","name":"bareMinerals"},"Price":24,"Color":"Ivory","Description":"bareMinerals READY Luminizer is an innovative concept in solid mineral technology. Created through a unique cold-pressed method, this formula combines a proprietary SeaNutritive Mineral Complex composed of positively-charged, antioxidant-rich sea minerals with cold-pressed kiwi seed oil for skin-nourishing benefits. This Luminizer Duo highlights the complexion with two lustrous complementary shades for soft, candlelit radiance.  Shades: Pink nectar glow/golden champagne To use: Swirl shades together and sweep over cheeks, eyes, forehead and bridge of nose for beautiful luminescence. Luminizers can also be applied individually for uniquely stunning effects. Web ID: 985361 ","Image":"https://img.shopstyle-cdn.com/sim/06/48/0648860166a7c530c5af9dcf40b996bc_medium/bareminerals-ready-luminizer-duo-the-love-affair-the-shining-moment.jpg","Category":"Makeup"},{"Name":"Tartelette Amazonian Clay Matte Eyeshadow Palette","Brand":{"id":"2090","name":"Tarte"},"Price":46,"Color":"Multi","Description":"By popular demand, tarte is introducing an all matte eyeshadow palette featuring 12 never-before-seen shades to inspire and empower real women to take on the day with confidence. The name says it all - this sleek, statement palette is all about the tartelette and features tart's signature Amazonian clay-infused eyeshadow in rich matte shades that are as beautifully diverse as the brand's loyal fans. Palette includes:  free spirit (cream) force of nature (nude) dreamer (warm brown) multi-tasker (chocolate) caregiver (pale pink) natural beauty (mauve) best friend (mulberry) bombshell (dark plum) super mom (ivory) wanderer (light brown) power player (taupe) fashionista (black) Always formulated without parabens, mineral oil, phthalates, triclosan, sodium lauryl sulfate, and gluten. Dermatologist tested. Web ID: 1935640 ","Image":"https://img.shopstyle-cdn.com/sim/43/40/434025235a55a4cb8d95b70666257be6_medium/tarte-tartelette-amazonian-clay-matte-eyeshadow-palette.jpg","Category":"Eye Makeup"},{"Name":"Cupio Off-The-Shoulder Top","Brand":{"id":"98","name":"Cable & Gauge"},"Price":70,"Color":"White","Description":"Cupio takes your look in a boho-inspired direction with this off-the-shoulder top designed with 3/4 bell sleeves.  Off-the-shoulder neckline 3/4 bell sleeves Hits at hip All cotton Machine washable Imported Web ID: 4673747 ","Image":"https://img.shopstyle-cdn.com/sim/e1/87/e1878d271fade42748763f1e866b8017_medium/cable-gauge-cupio-off-the-shoulder-top.jpg","Category":"Longsleeve Tops"},{"Name":"Chuck Taylor High Top Sneakers from Finish Line","Brand":{"id":"144","name":"Converse"},"Price":54.99,"Color":"OPTICAL WHITE","Description":"Individuality and retro basketball styling team up for the all-American favorite Converse Chuck Taylor® All Star® High Top sneakers.  Converse women's sneakers High top Vulcanized rubber outsole Style No. W7650 Women's athletic footwear from Finish Line Canvas upper; rubber sole Imported Web ID: 871181 ","Image":"https://img.shopstyle-cdn.com/sim/1b/b5/1bb5754385d097f060f098708de7ceb9_medium/converse-chuck-taylor-high-top-sneakers-from-finish-line.jpg","Category":"Sneakers"},{"Name":"Liquid Lipstick","Brand":{"id":"4096","name":"Anastasia Beverly Hills"},"Price":20,"Color":"Vintage","Description":"Full coverage, intense pigment, and a matte finish in an easy-to-apply liquid formula. One sweep delivers vibrant long-wearing color that sets all day.  Full Coverage Matte Color Intensely pigmented 32 Shades Available Web ID: 1914670 ","Image":"https://img.shopstyle-cdn.com/sim/6a/37/6a377d667f413b681de403950b45bffd_medium/anastasia-beverly-hills-liquid-lipstick.jpg","Category":"Lip Products"},{"Name":"Cora Embroidered Mini Dress","Brand":{"id":"226","name":"Free People"},"Price":148,"Color":"White","Description":"Enchant in this boho-chic mini dress from Free People, featuring a flowy silhouette, open sleeves, plunging neckline and gorgeous embroidery.  Pullover styling; ties at waist Short length Scalloped surplice neckline; A-line silhouette Open flutter sleeves Embroidered at front Viscose Machine washable Imported Web ID: 4697103 ","Image":"https://img.shopstyle-cdn.com/sim/a0/91/a0916baa8881b5dc818c1cd26e277f89_medium/free-people-cora-embroidered-mini-dress.jpg","Category":"Day Dresses"},{"Name":"Women's LunarEpic Low Flyknit 2 Running Sneakers from Finish Line","Brand":{"id":"422","name":"Nike"},"Price":160,"Color":"BLUE MOON/DK OBSIDIAN-VAP","Description":"Get an epic ride for your next run in the innovative and style-savvy Nike Women's LunarEpic Low Flyknit 2 Running Sneakers. Featuring a seamless Flyknit bootie and soft Lunarlon foam, you'll get the comfort you crave for the miles ahead.  Performance running sneakers Flyknit bootie construction for a secure feel Laser-cut pods for enhanced cushioning Flywire technology Flyknit upper with laser perforations at the forefoot Dual-injected midsole for lightweight flexibility Contoured Lunarlon foam cushioning Style no. 863780 Women's athletic footwear from Finish Line Synthetic upper; rubber sole Imported Web ID: 4651579 ","Image":"https://img.shopstyle-cdn.com/sim/77/45/7745be17d1f22c07fb67a7b9d112c632_medium/nike-womens-lunarepic-low-flyknit-2-running-sneakers-from-finish-line.jpg","Category":"Sneakers"},{"Name":"NYX Professional Makeup Doll Eye Mascara","Price":9.5,"Color":"WATERPROOF JET BLACK","Description":"Hello, dollface! For irresistibly fluttery eyelashes, try this mascara. Doll Eye Mascara uses a unique blend of natural oils, vitamin E and nylon fibers to extend eyelashes to almost faux proportions.  Choice of lengthening, volumizing or waterproofing versions Web ID: 3324577 ","Image":"https://img.shopstyle-cdn.com/sim/72/87/7287bb4cc761a38c728b43acded3263c_medium/nyx-professional-makeup-doll-eye-mascara.jpg","Category":"Mascara"},{"Name":"Garden Party Maxi Dress","Brand":{"id":"226","name":"Free People"},"Price":128,"Color":"Red Combo","Description":"Tie straps add charm to this lovely maxi dress from Free People, while a smocked bodice hugs your shape and flows into a beautiful A-line silhouette.  Pullover styling; ties at straps Long length Square neckline; A-line silhouette Smocked bodice; small ruffle detailing at skirt Rayon Machine washable Imported Web ID: 4697101 ","Image":"https://img.shopstyle-cdn.com/sim/dd/b7/ddb7650294648fd5ff083cb484b4ee93_medium/free-people-garden-party-maxi-dress.jpg","Category":"Day Dresses"},{"Name":"OCTAGONAL FLAT LENS Sunglasses, RB3556N 53","Brand":{"id":"1883","name":"Ray-Ban"},"Price":150,"Color":"GOLD/GREEN","Description":"From L.A. to St. Tropez and Soho to Tokyo, Ray-Ban is the brand of sunglasses preferred by true individuals worldwide. Setting the standard for excellence, Ray-Ban consistently combines great styling with exceptional quality, performance, and comfort.  Frame Style: SQUARE Frame Fit: STANDARD Lens Material: GLASS Eye/Bridge/Temple: 53/21/145 Case or Microfiber pouch included Web ID: 3702117 ","Image":"https://img.shopstyle-cdn.com/sim/36/e3/36e3311bccdc86f04724d47888bb611c_medium/ray-ban-octagonal-flat-lens-sunglasses-rb3556n-53.jpg","Category":"Sunglasses"},{"Name":"Skin Foundation SPF 15, 1 oz","Brand":{"id":"834","name":"Bobbi Brown"},"Price":50,"Color":"9 Chestnut","Description":"What is it: This water-based, oil-free formula delivers undetectable coverage and a fresh, hydrated glow for the most natural skin-like finish. Buildable formula goes easily from light to medium and is available in wide range of shades for all skin tones. Who is it for: Normal to oily skin types. Anyone who wants a water-based, oil-free foundation with a natural finish. Why it's different: The lightweight, water-based formula sinks into skin, instantly helping to plump, moisturize and boost skin’s glow. Sustained hydration keeps skin looking and feeling fresh, and ensures that color stays true all day. The oil-free formula is enhanced with light-reflective optic ingredients to give skin natural luminosity. In addition to weightless, long-wearing coverage and hydration, the formula minimizes the appearance of pores, conceals imperfections, and delivers broad spectrum UV protection. How to Use It: After moisturizing, apply with the Foundation Brush (sold separately) or fingers where needed to even out skin tone and cover imperfections. For complete coverage, dot foundation on nose, forehead, cheeks, and chin and blend out toward the hairline.  Web ID: 393197 ","Image":"https://img.shopstyle-cdn.com/sim/24/ed/24edd6f4f450d85aa4cd03a9d21cd1e1_medium/bobbi-brown-skin-foundation-spf-15-1-oz.jpg","Category":"Liquid Foundation"},{"Name":"Striped Sweater Dress","Brand":{"id":"338","name":"Lauren Ralph Lauren"},"Price":165,"Color":"Cream/Indigo","Description":"Cotton and linen yarn in various shades of the season's blue hue are twisted together and then knit to create this Lauren Ralph Lauren shift dress's subtle highs and lows.  Sleeveless shift silhouette Size medium has an approx. 37\" body length and 38\" bust Pull-on styling Crew neck Ribbed armholes Cotton/linen Machine washable Imported Web ID: 4695392 ","Image":"https://img.shopstyle-cdn.com/sim/37/a2/37a22b87469cc853c35dfc9620bf4ccf_medium/lauren-ralph-lauren-striped-sweater-dress.jpg","Category":"Day Dresses"},{"Name":"Textured Off-The-Shoulder Top, Only at Macy's","Brand":{"id":"31792","name":"Bar III"},"Price":59.5,"Color":"Deep Black","Description":"A textured feel, illusion detailing and bell sleeves add an intricate touch, while a smocked off-the-shoulder neckline offers serious fashion points to this Bar III top.  Smocked off-the-shoulder neckline; pullover style Textured pattern Flared cuffs Easy fit; hits at hip Only at Macy's Polyester; lining: polyester Hand wash Imported Web ID: 4549818 ","Image":"https://img.shopstyle-cdn.com/sim/2b/73/2b7375735383caee0f7c84a0c219718f_medium/bar-iii-textured-off-the-shoulder-top-only-at-macys.jpg","Category":"Teen Girls' Tops"},{"Name":"Chuck Taylor Dainty Casual Sneakers from Finish Line","Brand":{"id":"144","name":"Converse"},"Price":54.99,"Color":"FRESH CYAN","Description":"Adorable and fun, the Converse CT Dainty Casual Sneakers are cute enough for date night, and casual enough for everyday. With Chuck Taylor branding and feminine styling, these little numbers are the best of both worlds.  Slimmer, more feminine Chuck Taylor silhouette Chuck Taylor branding Textile-lining Style no. 556155F Women's athletic footwear from Finish Line Canvas upper; rubber sole Imported Web ID: 3286448 ","Image":"https://img.shopstyle-cdn.com/sim/f3/fa/f3fa95a3c6eb0c6b2e3883f577968d3a_medium/converse-chuck-taylor-dainty-casual-sneakers-from-finish-line.jpg","Category":"Sneakers"},{"Name":"Babe Lace-Up Oxfords","Brand":{"id":"3736","name":"Wanted"},"Price":49,"Color":"Tan","Description":"A great menswear look you can wear any day, the Babe oxfords from Wanted have a classic silhouette and sensible heel.  Manmade upper Almond closed-toe oxfords with lace-up closure 3/4\" heel Manmade sole Imported Web ID: 2495253 ","Image":"https://img.shopstyle-cdn.com/sim/33/51/33517f3d8142d3c01d22d7369d03ef1d_medium/wanted-babe-lace-up-oxfords.jpg","Category":"Flats"},{"Name":"hoola matte bronzing powder","Brand":{"id":"33215","name":"Benefit Cosmetics"},"Price":29,"Color":"Hoola","Description":"Dust this award-winning bronzing powder over your chin, cheeks and forehead for a healthy, natural looking \"tan\" year-round. Complete with soft, natural-bristle cheek brush, it's pure matte color...no sparkle or shine!  How to use: Sweep across chin, cheeks, and forehead with accompanying brush. To contour, use with our blush brush Beauty Tip: Apply hoola over benetint for bronzed cheekbones with a hint of rose tint. Always tap off excess powder to avoid applying too much color. Web ID: 64581 ","Image":"https://img.shopstyle-cdn.com/sim/b6/0a/b60af86f63bb79342a5ecc2a67b5f21c_medium/benefit-cosmetics-hoola-matte-bronzing-powder.jpg","Category":"Sun Bronzers & Self-Tanners"},{"Name":"Forever Cuffed Denim Shorts","Brand":{"id":"292","name":"Jessica Simpson"},"Price":49.5,"Color":"White","Description":"Flaunt a super-sleek silhouette in Jessica Simpson's weekend-ready colored denim shorts with cuffed legs.  Mid rise; slim fit through hips and thighs; cuffed legs Approximate inseam: 3\" Front button closure with zipper fly; belt loops Five-pocket styling; two back patch pockets Colored denim Cotton/elastane Machine washable Imported Web ID: 4558743 ","Image":"https://img.shopstyle-cdn.com/sim/d7/00/d700189c90dc346b348d4eeb0d92af44_medium/jessica-simpson-forever-cuffed-denim-shorts.jpg","Category":"Teen Girls' Shorts"},{"Name":"Off-The-Shoulder Romper","Brand":{"id":"28822","name":"Denim & Supply Ralph Lauren"},"Price":125,"Color":"White Romper","Description":"An off-the-shoulder neckline and airy gauze define the bohemian-inspired vibe of this Denim & Supply Ralph Lauren romper.  Size medium has an approx. 47-1/4\" bust, 23\" sleeve length, and 2\" inseam Smocked off-the-shoulder neckline Long sleeves with elasticized cuffs Smocked waistband Lined below the waist Shell: cotton/viscose; lining: polyester Hand wash Imported Web ID: 3583259 ","Image":"https://img.shopstyle-cdn.com/sim/40/27/4027a9d245b6f349933b5b76c0db72d8_medium/denim-supply-ralph-lauren-off-the-shoulder-romper.jpg","Category":"Shorts"},{"Name":"I'll Be Around Asymmetrical Cardigan","Brand":{"id":"226","name":"Free People"},"Price":128,"Color":"Sapphire","Description":"This beautifully knit Free People cardigan boasts a shawl collar with a carefree open front. The asymmetrical hem lends a cascading affect to this folksy piece.  Shawl collar Open front; no closure Asymmetrical hem Hits below hip Silk/cotton/nylon Hand wash Imported Web ID: 4654339 ","Image":"https://img.shopstyle-cdn.com/sim/2b/11/2b11cfbe42f6ef60c4df82fa595d4451_medium/free-people-ill-be-around-asymmetrical-cardigan.jpg","Category":"Cardigans"},{"Name":"Nail Color, Fun In The Gondola","Brand":{"id":"4187","name":"Essie"},"Price":9,"Color":"fun in the gondola","Description":"A soft creamy mauve.  This product will be delivered by Standard Ground Shipping and is not eligible for Premium or Overnight Shipping. Web ID: 581845 ","Image":"https://img.shopstyle-cdn.com/sim/32/c6/32c600e5364ea36be15065a21d94b966_medium/essie-nail-color-fun-in-the-gondola.jpg","Category":"Nail Polish"},{"Name":"Cotton Ripped Skinny Jeans","Brand":{"id":"226","name":"Free People"},"Price":78,"Color":"Moss","Description":"Add a street-chic tone to any outfit with these trend-right skinny jeans from Free People.  Mid rise; skinny fit through hips and thighs; skinny leg is cropped above ankle Approx. inseam: 28\" Front zipper and button closure; belt loops Five-pocket styling Ripped at knees Medium blue wash with fading and whiskering Cotton/polyester/spandex Machine washable Imported Web ID: 4541328 ","Image":"https://img.shopstyle-cdn.com/sim/9d/d7/9dd79c55dd90ab47253ea13cc57c74b3_medium/free-people-cotton-ripped-skinny-jeans.jpg","Category":"Skinny Denim"},{"Name":"NUDESTIX Magnetic Luminous Eye Color Pencil","Price":24,"Color":"Twilight","Description":"The NUDESTIX Magnetic Eye Color is a 4-in-1 long-wearing and waterproof eye shadow, eyeliner, base and highlighter pencil that is easy to use, gives intense color, precise lining and primes lids for all day wear. Ideal for oily lids, these fun and sassy touch n'go makeup stix are soft and super gliding, with even payoff for a 24-hour wear.  Includes: Magnetic Eye Pencil, 0.10 oz Black Tin Mirror Pencil sharpener This product has been dermatologist-tested for the most sensitive skin and is safe for use on the water-line (Ophthalmologist tested for sensitive eyes) Vegan, Hypoallergenic, Gluten-free, Cruelty-free, Fragrance-free, Preservative free This product is also formulated without: parabens, sulfates, phthalates Web ID: 2988837 ","Image":"https://img.shopstyle-cdn.com/sim/79/e1/79e1fdfac16063939898f656e2ba87fc_medium/nudestix-magnetic-luminous-eye-color-pencil.jpg","Category":"Eyeliner"},{"Name":"Fair Child Embroidered Mini Skirt","Price":129,"Color":"Black/Multi","Description":"Let your fashion sense take center stage in this eye-catching mini skirt from Fair Child.  Zipper closure at back Scalloped hem A-line silhouette Lined Hits at thigh Designed by Karen Fairchild of Little Big Town Cotton; embroidery: rayon; lining: polyester Hand wash Imported Web ID: 4489695 ","Image":"https://img.shopstyle-cdn.com/sim/05/38/0538737457c4fd542d002d896a7c3d8d_medium/fair-child-embroidered-mini-skirt.jpg","Category":"Mini Skirts"},{"Name":"Cotton Lush Life Illusion Flyaway Crop Top","Brand":{"id":"226","name":"Free People"},"Price":108,"Color":"White","Description":"Brilliantly offsetting the preppy high-neckline of the front, Free People's boho top goes full flyaway at the back with a bold, open split. The structured sleeve design contributes to the boxy fit of this cropped piece and illusion details add extra drama to the yoke.  High ruffled neckline; four-button closure at back Illusion crochet and lace insets at front yoke; open flyaway split at back Short bell sleeves with lace trim Hits at high hip Cotton Hand wash Imported Web ID: 4655769 ","Image":"https://img.shopstyle-cdn.com/sim/5b/53/5b53a7b739bbf6b81c261076f15e37dc_medium/free-people-cotton-lush-life-illusion-flyaway-crop-top.jpg","Category":"Shortsleeve Tops"},{"Name":"Glow Kit","Brand":{"id":"4096","name":"Anastasia Beverly Hills"},"Price":40,"Color":"NEW! Sundipped","Description":"Four velvety finishing powders that instantly cast a lit-from-within glow. Complementing shades can be layered together or worn separately on cheeks for definition. Results are flawlessly incandescent. Available in 3 shades: Gleam, That Glow and Sun Dipped.  Web ID: 2661869 ","Image":"https://img.shopstyle-cdn.com/sim/c2/f0/c2f0247bf3f83fb6f2f0defcc2048143_medium/anastasia-beverly-hills-glow-kit.jpg","Category":"Makeup Sets"},{"Name":"Tummy-Control Skinny Pants, Only at Macy's","Brand":{"id":"20","name":"Alfani"},"Price":39.98,"Color":"Urban Olive","Description":"Alfa's essential tummy-control pants feature a stretchy fit and a sleek silhouette, giving you comfort throughout the day without sacrificing comfort and style.  Tummy control panel slenderizes mid-section and retains shape. Mid rise; slim fit through hips and thighs; skinny leg Comfy mid-weight stretch woven fabric Available in approx. inseams: 28\" (S), 31\" (R) Only at Macy's Perfect for any occasion paired with your favorite top. Complete with jacket for an office ready look or heel for a formal occasion. Rayon/nylon/spandex Machine washable Imported Web ID: 700371 ","Image":"https://img.shopstyle-cdn.com/sim/b3/f2/b3f2b66728bd621326462e15f7e69035_medium/alfani-tummy-control-skinny-pants-only-at-macys.jpg","Category":"Skinny Pants"},{"Name":"Naked3 Eyeshadow Palette","Brand":{"id":"3501","name":"Urban Decay"},"Price":54,"Color":"Urban Olive","Description":"Experiment with 12 never-before-seen (and insanely beautiful) rose-hued neutrals from Urban Decay. From pale, shimmery pink to deep black matte with red micro-glitter, these neutrals will make you want to get Naked all over again. Urban Decays previous Naked palettes have always included new shades, but this is the first time theyve done a Naked palette with 12 NEW shades that aren't available anywhere else. Choose from every finish imaginable: ultra-smooth mattes, gorgeous pearls and glimmering metallics. Every shade features Urban Decay's Pigment Infusion System, the proprietary blend of ingredients that gives each shade its velvety texture, rich color, serious staying power and blendability. Naked3 includes a NEW double-ended shadow/blending brush. Naked3 comes in an art-school-inspired tin case in a gorgeous rose-gold color that hints at the shades inside. Embossed on top with a big \"Naked3\" and cool facets that beg to be touched, this case is sure to inspire lots of jealous stares.  Shade Descriptions: Strange (pale neutral pink matte-satin), Dust (pale metallic pink shimmer w/iridescent micro-glitter), Burnout (light pinky-peach satin), Limit (light dusty rose matte), Buzz (metallic rose shimmer w/silver micro-glitter) Trick (light metallic pinky-copper shimmer w/tonal micro-sparkle), Nooner (medium pinky-brown matte), Liar (medium metallic mauve shimmer), Factory (pinky-brown satin), Mugshot (metallic taupe shimmer w/slight pink shift) Darkside (deep taupe-mauve satin) and Blackheart (smoky black matte w/rosy red micro-sparkle) Beauty Tip: For the perfect pencil to finish the look, try the Naked3 24/7 Glide-On Double-Ended Eye Pencil, featuring two NEW shades of our award-winning 24/7 formula: Darkside and Darkheart. Web ID: 1146116 ","Image":"https://img.shopstyle-cdn.com/sim/be/ad/bead3f95e374c8c719fc9f2ae8bc7905_medium/urban-decay-naked3-eyeshadow-palette.jpg","Category":"Eye Makeup"},{"Name":"Maxi Shirtdress","Brand":{"id":"372","name":"MICHAEL Michael Kors"},"Price":140,"Color":"True Navy","Description":"Solidify your career-chic style in MICHAEL Michael Kors' maxi shirtdress, complete with a classic collar and handy pockets.  Front button closure Hits at ankle Point collar; Maxi silhouette Front flap patch pockets; self-tie belt; slits at side hem Unlined Polyester/elastane Machine washable Imported Web ID: 4533684 ","Image":"https://img.shopstyle-cdn.com/sim/fd/81/fd81ad911f99b2bfd51d5d84fcbff2ee_medium/michael-michael-kors-maxi-shirtdress.jpg","Category":"Day Dresses"},{"Name":"Wide-Leg Jersey Jumpsuit","Brand":{"id":"338","name":"Lauren Ralph Lauren"},"Price":119,"Color":"Black","Description":"A contrasting panel sweeps across the front of this wide-leg jumpsuit from Lauren Ralph Lauren. In fluid jersey, this modern style is an effortlessly chic look.  Sleeveless wide-leg silhouette Size 8 has an approximate 11-1/4\" rise and 29\" leg-opening circumference All sizes have an approximate 32-1/2\" inseam Concealed center-back zipper with a hook-and-eye closure Rounded neckline Shaping darts at the back waist Contrasting panel wraps from the left waist to the right leg Lined at the bodice Model is 5'10\"/178 cm and wears a size 4 Polyester/elastane Machine washable Imported Web ID: 2791174 ","Image":"https://img.shopstyle-cdn.com/sim/3e/8f/3e8fbb740905c7f67c1d8a818783938f_medium/lauren-ralph-lauren-wide-leg-jersey-jumpsuit.jpg","Category":"Wide Leg Pants"},{"Name":"Rising Sun Scoop-Neck T-Shirt","Brand":{"id":"226","name":"Free People"},"Price":58,"Color":"Wine","Description":"Look effortlessly cool in this drapey T-shirt from Free People.  Scoop neckline Pullover style One patch pocket at chest; side vents Loose fit Hits at hip Rayon/spandex Machine washable Imported Web ID: 2997640 ","Image":"https://img.shopstyle-cdn.com/sim/f1/5b/f15b641b424e07c632eccfbd15f0cdc0_medium/free-people-rising-sun-scoop-neck-t-shirt.jpg","Category":"Tees"},{"Name":"Striped Jersey Dress","Brand":{"id":"338","name":"Lauren Ralph Lauren"},"Price":139,"Color":"Black / Colonial Cream","Description":"Variegated stripes add graphic allure to this body-skimming jersey sheath dress from Lauren Ralph Lauren—a timeless must-have.  Sleeveless sheath silhouette Size 8 has an approximate 37-1/2\" back body length Pull-on styling Crew neckline Button-and-loop keyhole closure at the center back of the neck Shirring gathers at the left waist Fully lined Model is 5'10\"/178 cm and wears a size 4 Shell and lining: polyester/elastane Machine washable Imported Web ID: 2903634 ","Image":"https://img.shopstyle-cdn.com/sim/c9/41/c941d775e7ad3072af3d941081688f97_medium/lauren-ralph-lauren-striped-jersey-dress.jpg","Category":"Day Dresses"},{"Name":"Women's Denise Embellished Slide Sandals","Brand":{"id":"552","name":"Steve Madden"},"Price":79,"Color":"Taupe Velvet","Description":"Studded with shimmer, Steve Madden's Denise sandals make it effortless to slip into a look with glamorous simplicity.  Fabric content and colors include: Suede in blue multi Velvet fabric in taupe Round-toe slip-on sandals Embellishment at upper 1/2\" heel Suede or velvet fabric uppers; leather sole Imported Web ID: 4616701 ","Image":"https://img.shopstyle-cdn.com/sim/8a/c5/8ac5308e12f3567a7ad1c7fbce6d1211_medium/steve-madden-womens-denise-embellished-slide-sandals.jpg","Category":"Sandals"},{"Name":"Sarina Peep-Toe Slides","Brand":{"id":"616","name":"Vince Camuto"},"Price":129,"Color":"Smoke Show","Description":"Vince Camuto's Sarina mules are reliable and stylish, so you can wear them for just about anything.  Fabric content and colors include: Leather in black Suede in smoke show Almond peep-toe slip-on slides 4\" stacked Leather or suede uppers; manmade sole Imported Web ID: 4462127 ","Image":"https://img.shopstyle-cdn.com/sim/bb/58/bb58a49af2a43384da34da3f0a8b7211_medium/vince-camuto-sarina-peep-toe-slides.jpg","Category":"Mules & Clogs"},{"Name":"STS Blue Emma Ripped Skinny Jeans","Price":48,"Color":"North Ashbury","Description":"You'll have legs for days in these so-chic ripped skinny jeans from STS Blue.  Mid rise; skinny fit through hips and thighs; skinny leg Approx. inseam: 27\" Front zipper and button closure; belt loops Classic 5-pocket styling Ripped throughout; frayed hem Dark blue wash with fading and whiskering Cotton/elastane Machine washable Imported Web ID: 4479999 ","Image":"https://img.shopstyle-cdn.com/sim/7f/e4/7fe451925e00adf7d104812386c70578_medium/sts-blue-emma-ripped-skinny-jeans.jpg","Category":"Skinny Denim"},{"Name":"GEN NUDETM Radiant Lipstick","Brand":{"id":"17038","name":"bareMinerals"},"Price":20,"Color":"XOX","Description":"Creamy, moisturizing lipsticks in a range of flattering nude shades for all skin tones. When it comes to the nude lip, there is no such thing as one-size-fits-all color. Meet the next generation of nude. Gen NudeTM Radiant Lipstick is addictively creamy color with medium coverage and balmy shine. Formulated with natural oils and butters to moisturize, smooth and condition lips, with a subtle vanilla scent. Gen NudeTM was developed for all skin tones and lip tones, to be a playground of nude lip shades for everyone, from makeup novice to artist. Whether you want an edgy, blanked-out nude look, a natural your-lips-but-better nude, or a deeper neutral contrast color, you're guaranteed to find shades for any look. Blend and layer colors and finishes for infinite ways to go nude.  Medium coverage Moisturizing color Demi-shine finish Addictive creamy texture Formulated without parabens, sulfates or phthalates This product is gluten-free and was not tested on animals Active ingredients: Mango, Cocoa and Shea Butters: moisturizing and smoothing; imparts a creamy texture How to use: Apply Gen NudeTM Radiant Lipstick directly from the bullet, or use the Double-Ended Perfect Fill Lip Brush for more definition Use with bareMinerals Gen NudeTM Under OverTM Lip Liner, the Double-Ended Perfect Fill Lip Brush and GEN NUDETM Buttercream Lipgloss Available in shades of Mauve, Pink, Peach, and Beige Web ID: 2859730 ","Image":"https://img.shopstyle-cdn.com/sim/f9/0e/f90e213179531b2e66c361909da0a960_medium/bareminerals-gen-nudetm-radiant-lipstick.jpg","Category":"Lipstick"},{"Name":"Cotton Ripped Skinny Jeans","Brand":{"id":"226","name":"Free People"},"Price":78,"Color":"White","Description":"Add a street-chic tone to any outfit with these trendy skinny jeans from Free People.  High rise; skinny fit through hips and thighs; skinny leg is cropped at ankle Approx. inseam: 25\" Front zipper and button closure; belt loops Five-pocket styling Ripped at knees White wash Cotton/lyocell/polyester/spandex Machine washable Imported Web ID: 4541349 ","Image":"https://img.shopstyle-cdn.com/sim/80/89/8089315493cec2493c51d2a222541dcc_medium/free-people-cotton-ripped-skinny-jeans.jpg","Category":"Skinny Denim"},{"Name":"Pull-On Skort, Only at Macy's","Brand":{"id":"119","name":"Charter Club"},"Price":54.5,"Color":"Sedona Dust","Description":"Charter Club's versatile skort gives you the relaxed comfort of shorts with a stylish twist.  Mid rise; straight fit through hips and thighs Approximate model measurements: height: 5'10\"; bust: 35.5\"; waist: 27\"; hips: 35\" Pull-on styling Attached shorts Only at Macy's Rayon/nylon/spandex; lining: polyester Machine washable Imported Web ID: 3430649 ","Image":"https://img.shopstyle-cdn.com/sim/40/f3/40f3774f3f2bf8e508d6d3c199e02d38_medium/charter-club-pull-on-skort-only-at-macys.jpg","Category":"Mid-length Skirts"},{"Name":"Cotton Distressed V-Neck T-Shirt","Brand":{"id":"226","name":"Free People"},"Price":58,"Color":"White","Description":"Distressed detailing is the perfect finish for this laid-back T-shirt from Free People, in a relaxed fit with a wide V-neckline and drop sleeves for chic comfort.  V-neckline Distressed detailing; vents at sides Short sleeves with drop shoulders Relaxed fit; hits at hip All cotton Machine washable Imported Web ID: 4734989 ","Image":"https://img.shopstyle-cdn.com/sim/c3/8c/c38c39218babc6e6589f51db3f17921e_medium/free-people-cotton-distressed-v-neck-t-shirt.jpg","Category":"Tees"},{"Name":"Floral-Print Gauze Top","Brand":{"id":"28822","name":"Denim & Supply Ralph Lauren"},"Price":89.5,"Color":"Lanci Floral","Description":"In airy cotton-blend gauze, this floral-print Denim & Supply Ralph Lauren top is a feminine piece with a boho vibe. Leave its tasseled ties loose and drape the neckline over one shoulder, or knot them at the front to form an alluring keyhole.  Rounded drawcord neckline; keyhole secures with tasseled ties at the center front Size medium has an approx. 19\" front body length, 23\" back body length and 53-1/2\" bust Ruffled trim at the sleeves and the waist; drawcord hem with tasseled ties Three-quarter-length sleeves with elasticized cuffs Relaxed fit Cotton/viscose Hand wash Imported Web ID: 3583225 ","Image":"https://img.shopstyle-cdn.com/sim/76/60/766087a3975b9c73f977e36348711f9a_medium/denim-supply-ralph-lauren-floral-print-gauze-top.jpg","Category":"Tops"},{"Name":"Tatiana Off-The-Shoulder Maxi Dress","Brand":{"id":"32108","name":"Astr"},"Price":140,"Color":"Ivory","Description":"The off-the-shoulder neckline of this ASTR dress is accented by a lovely flounce, while delicate embroidery transitions into lovely crochet lace for an ultra-feminine appeal.  Pullover style; tassel closures at waist Long length Off-the-shoulder neckline; A-line silhouette Crochet lace detailing at flounce overlay and hem; embroidered throughout Polyester; lining and inset: polyester Dry clean Imported Web ID: 4697748 ","Image":"https://img.shopstyle-cdn.com/sim/38/ba/38baf41576bb73ef7509d804445c7cb3_medium/astr-tatiana-off-the-shoulder-maxi-dress.jpg","Category":"Day Dresses"},{"Name":"Kivah Block-Heel Dress Sandals, Only at Macy's","Brand":{"id":"273","name":"INC International Concepts"},"Price":89.5,"Color":"Spring Red","Description":"Dress up your look any time of day with the delicate ankle strap and chunky, block heel on INC International Concepts' Kivah sandals.  Round open-toe ankle-strap dress sandals Adjustable buckle closure at ankle strap; memory foam padding for added comfort 3-1/4\" wrapped block heel Only at Macy's Uppers: leather and fabric; lining and sole: manmade Imported Web ID: 2793022 ","Image":"https://img.shopstyle-cdn.com/sim/7a/6e/7a6e80293abd81fffec18d1c6136cf92_medium/inc-international-concepts-kivah-block-heel-dress-sandals-only-at-macys.jpg","Category":"Sandals"},{"Name":"Trendy Plus Size Pleated Fit & Flare Dress","Brand":{"id":"2020","name":"Soprano"},"Price":59,"Color":"Cherry Cola","Description":"A pleated skirt adds dimension to the flared A-line skirt on this gorgeous plus size dress from Soprano, finished with a plunging V-neckline.  Exposed back zipper closure Short length V-neckline; A-line silhouette Pleated skirt Unlined Rayon/spandex Machine washable Imported Web ID: 4638128 ","Image":"https://img.shopstyle-cdn.com/sim/89/26/8926a34b16f4e3382eae330aa0c852dc_medium/soprano-trendy-plus-size-pleated-fit-flare-dress.jpg","Category":"Clothing"},{"Name":"Trendy Plus Size Wide-Leg Shorts","Brand":{"id":"31760","name":"City Chic"},"Price":59,"Color":"Pool","Description":"In a relaxed, wide-leg design that offers extra coverage over the hips, City Chic's plus size shorts give the impression of a mini skirt. This leaf-print style zips up at the back for a polished, fitted waistline.  Mid rise; relaxed fit through hips and thighs Hits at thigh; approx. inseam: 3-1/2\" Concealed back zipper closure On-seam pockets at hip Polyester/elastane Hand wash Imported Web ID: 4784781 ","Image":"https://img.shopstyle-cdn.com/sim/85/d2/85d2f1b19ddf1bbd6265b89811d5d308_medium/city-chic-trendy-plus-size-wide-leg-shorts.jpg","Category":"Teen Girls' Intimates"},{"Name":"M. Haskell for Gold-Tone Pineapple Stretch Bracelet, Only at Macy's","Brand":{"id":"273","name":"INC International Concepts"},"Price":26.5,"Color":"Gold","Description":"Flaunt your fabulous style sense with this unique pineapple design stretch bracelet by M. Haskell for INC International Concepts, created in gold-tone mixed metal. Approximate diameter: 3-1/2\".  Only at Macy's Web ID: 4599983 ","Image":"https://img.shopstyle-cdn.com/sim/53/fb/53fb30dd69d462b8e5754bdd63d1c127_medium/inc-international-concepts-m-haskell-for-gold-tone-pineapple-stretch-bracelet-only-at-macys.jpg","Category":"Bracelets"},{"Name":"High-Low Handkerchief-Hem Top","Brand":{"id":"226","name":"Free People"},"Price":78,"Color":"Purple","Description":"A dramatic high-low hem offers movement and eye-catching style in Free People's chic top.  Scoop neckline; low scoop at back Pullover styling High-low handkerchief hem Hits at top of thigh Cotton/polyester/rayon Machine washable Imported Web ID: 4462182 ","Image":"https://img.shopstyle-cdn.com/sim/ce/6f/ce6fbe2aab47ba83dfd98b3c1a63aedf_medium/free-people-high-low-handkerchief-hem-top.jpg","Category":"Tops"},{"Name":"Jeneve Strappy Block-Heel Sandals","Brand":{"id":"616","name":"Vince Camuto"},"Price":119,"Color":"Maple Brown","Description":"Sensationally stylish, Marc Fisher's Jeneve sandals amp up both jeans and dresses with crisscross straps and a bow detail finished with a sculpted heel.  Round-toe crisscross ankle-strap sandals Zipper closure with bow detail at back 3\" sculpted stacked block heel Suede upper; manmade sole Imported Web ID: 4448645 ","Image":"https://img.shopstyle-cdn.com/sim/24/07/2407cfd9f20de1089ec75c1af22a1ad9_medium/vince-camuto-jeneve-strappy-block-heel-sandals.jpg","Category":"Sandals"},{"Name":"Be Bop Juniors' Printed Surplice Romper with Sash Belt","Price":39,"Color":"Yellow/Fuschia","Description":"You'll be ready in a flash for wherever your day takes you when you wear Be Bop's sleeveless romper, detailed with a surplice neckline, back cutout and a sash belt.  Surplice neckline with concealed snap closure Sleeveless Button closure at back neck; back cutout Removable self-tie sash belt; dressmaker's belt loops Two side pockets Relaxed fit Approximate inseam: 2.5\" Available in solids and prints Rayon Hand wash Imported Web ID: 4649834 ","Image":"https://img.shopstyle-cdn.com/sim/6f/0e/6f0e906006253e16b8760c0241eaa90e_medium/be-bop-juniors-printed-surplice-romper-with-sash-belt.jpg","Category":"Teen Girls' Shorts"},{"Name":"Be Legendary Matte Lipstick, 0.1 oz","Brand":{"id":"2009","name":"Smashbox"},"Price":21,"Color":"Violet Riot (Bright Purple Matte)","Description":"A cream lipstick that glides on brilliant color in just one swipe. Be Legendary was named after the first red lipstick developed at Smashbox. It’s a classic Hollywood shade inspired by their L.A. photo studio—and the iconic celebs who are shot there to this day.  Silky, vitamin-fortified formula stays put without drying out or settling unevenly on the lips Pops on camera and stays color-true in photographs Usage Tips: To change the shape of lips, subtly round out your upper lip around the Cupid's bow with Always Sharp Lip Liner for an iconic, heart-shaped pout. Use Punked as a transformer shade to darken and deepen other lipsticks. Formulated without Parabens, Sodium Lauryl Sulfate, Talc, Alcohol. This product is cruelty-free. Web ID: 2292215 ","Image":"https://img.shopstyle-cdn.com/sim/51/b6/51b679b16e8e48ae41043443a5124851_medium/smashbox-be-legendary-matte-lipstick-0-1-oz.jpg","Category":"Lipstick"},{"Name":"Cotton Gingham Peplum Top, Only at Macy's","Brand":{"id":"32346","name":"Maison Jules"},"Price":59.5,"Color":"Blu Notte Co","Description":"A flattering peplum-hem silhouette pairs with a sweet gingham print on this pretty sleeveless top from Maison Jules.  Square neckline; smocked at back Peplum hem Hits above hip Only at Macy's All cotton Machine washable Made in China Web ID: 4528835 ","Image":"https://img.shopstyle-cdn.com/sim/66/16/6616eac3a5eb451eeda013ac2404f9d1_medium/maison-jules-cotton-gingham-peplum-top-only-at-macys.jpg","Category":"Sleeveless Tops"},{"Name":"Pine Slip-On Espadrille Wedge Mules","Brand":{"id":"225","name":"Franco Sarto"},"Price":79,"Color":"White","Description":"Add Franco Sarto's Pine espadrilles to your look any time of year in a fashion-forward accent fashioned with a chunky platform wedge heel for a fresh boost.  Fabric content and colors include: Suede in camel, orange, medium blue or lemon Leather in black or white Metallic canvas in platinum Round-toe slip-on platform wedge mule sandals 2-1/2\" espadrille wedge heel, 1-1/4\" platform, feels like 2-1/4\" heel Leather, suede or canvas upper; manmade sole Imported Web ID: 4368823 ","Image":"https://img.shopstyle-cdn.com/sim/bd/3d/bd3d55e9086603de03922d24b8c3c37f_medium/franco-sarto-pine-slip-on-espadrille-wedge-mules.jpg","Category":"Wedges"},{"Name":"Pretty & Free Off-The-Shoulder Cutout Romper","Brand":{"id":"226","name":"Free People"},"Price":98,"Color":"Pink","Description":"Be a showstopper in this sexy little romper from Free People, featuring a revealing cutout at back and leg-baring silhouette.  Off-the-shoulder neckline Long sleeves with smocked cuffs Pull-on style Cutout at back Smocked elastic waist Off-seam pockets Straight fit through hips and thighs Approximate inseam: 2\" Rayon Machine washable Imported Web ID: 4565457 ","Image":"https://img.shopstyle-cdn.com/sim/23/d7/23d7d9ffcdad17e081c9ba5827b66673_medium/free-people-pretty-free-off-the-shoulder-cutout-romper.jpg","Category":"Shorts"},{"Name":"Striped Culottes","Brand":{"id":"31658","name":"J.o.a."},"Price":75,"Color":"Navy Multi","Description":"Sophistication filters through the entire silhouette of J.O.A.'s striped culottes. This breezy design is cropped at the mid-calf to best show off your favorite sandals.  Mid rise; relaxed fit through hips and thighs; wide leg is cropped at mid calf Approx. inseam: 21-1/4\" Concealed side zipper closure Polyester; lining: polyester Hand wash Imported Web ID: 4752117 ","Image":"https://img.shopstyle-cdn.com/sim/68/72/6872639d8d58580f49249de5d0e49c5b_medium/j-o-a-striped-culottes.jpg","Category":"Pants"},{"Name":"Tank Midi Dress","Brand":{"id":"14892","name":"Kensie"},"Price":69,"Color":"Heather Ash","Description":"Make a fun and flirty exit in this easygoing tank dress from kensie, cut in curve-hugging midi silhouette with a large cutout at the back.  Pullover styling Midi length Scoop neckline; Bodycon silhouette Textured; large cutout at upper back with twisted strap detail Unlined Viscose/spandex Hand wash Imported Web ID: 4637567 ","Image":"https://img.shopstyle-cdn.com/sim/05/db/05dbde22b940be3d542ca91ae8803dfc_medium/kensie-tank-midi-dress.jpg","Category":"Day Dresses"},{"Name":"GEN NUDETM Buttercream Lipgloss","Brand":{"id":"17038","name":"bareMinerals"},"Price":18,"Color":"Totally","Description":"Moisturizing, plumping lipgloss in a range of gorgeous nude shades for all skin tones. When it comes to the nude lip, think beyond one-size-fits-all color. Meet the next generation of nude. Gen NudeTM Buttercream Lipgloss delivers ultra-creamy, moisturizing color with sheer buildable coverage and balmy, non-sticky shine. Formulated with plumping ingredients for fullness without the tingle. Contains a subtle vanilla scent. Gen NudeTM was developed for all skin tones and lip tones, to be a playground of nude lip shades for everyone, from makeup novice to artist. Whether you want an edgy, blanked-out nude look, a natural your-lips-but-better nude, or a deeper neutral contrast color, you're guaranteed to find shades for any look. Blend and layer colors and finishes for infinite ways to go nude.  Sheer-to-medium coverage Moisturizing, non-tingling, plumping formula Non-sticky, balmy shine Ultra-buttery texture Formulated without parabens, sulfates or phthalates This product is gluten-free and was not tested on animals Active ingredients: Volulip: a natural peptide that increases lip volume and supports lip hydration by locking in moisture, with no tingling sensation Shea, Avocado, Murumuru and Cupuacu butters: helps with moisturizing, smoothing, non-sticky feel How to use: Apply one coat for a sheer wash of nude color, or layer more coats for more color Apply over Gen NudeTM Radiant Lipstick for a rich, layered nude lip Use the Double-Ended Perfect Fill Lip Brush to mix custom blends Available in shades of Mauve, Pink, Peach, and Beige Web ID: 2860412 ","Image":"https://img.shopstyle-cdn.com/sim/3a/a1/3aa19825f56edbaca11a329979538d8f_medium/bareminerals-gen-nudetm-buttercream-lipgloss.jpg","Category":"Lip Products"},{"Name":"Cropped Shirt, Only at Macy's","Brand":{"id":"1868","name":"Rachel Roy"},"Price":89,"Color":"Bright Blue Combo","Description":"RACHEL Rachel Roy's vibrant shirt evokes the tropics with a lush floral print, designed with a cropped silhouette and a chic tie-front hem.  Point collar; front button closures Tie detail at front hem Hits at waist Only at Macy's Polyester Dry clean Imported Web ID: 4586220 ","Image":"https://img.shopstyle-cdn.com/sim/8b/57/8b57160663cf38ea9ca6099d0c6de70b_medium/rachel-roy-cropped-shirt-only-at-macys.jpg","Category":"Button Front Tops"},{"Name":"Uh Huh Ruffled Scoop-Back Bodysuit","Brand":{"id":"226","name":"Free People"},"Price":58,"Color":"Blue","Description":"Free People's scoop-back bodysuit is your go-to for a fitted look that stays perfectly in place.  Scoop neckline with deep scoop-back; snap closure at bottom seam Ruffle at front and back neckline Full bodysuit Rayon/spandex Machine washable Imported Web ID: 4565466 ","Image":"https://img.shopstyle-cdn.com/sim/1c/f3/1cf3ef495817bbc26dac9887edc2c8ac_medium/free-people-uh-huh-ruffled-scoop-back-bodysuit.jpg","Category":"Sleeveless Tops"},{"Name":"501® Cutoff Denim Shorts","Brand":{"id":"345","name":"Levi's"},"Price":49.5,"Color":"Lost Horizon","Description":"Levi's® 501® shorts are a timeless must-have. A perfect pick for the beach or the city, paired with flats or wedges.  Mid rise: waistband sits below natural waist Button closure with zip fly; belt loops Five-pocket styling Available in multiple washes Cutoff hem Approximate inseam: 3 inches Cotton Machine washable Imported Web ID: 2655363 ","Image":"https://img.shopstyle-cdn.com/sim/fd/ff/fdffd03e5bfbf83c77ed51538cb6ae81_medium/levis-501-cutoff-denim-shorts.jpg","Category":"Shorts"},{"Name":"Women's Rizza Lace-Up Block-Heel Sandals","Brand":{"id":"552","name":"Steve Madden"},"Price":79,"Color":"Olive Suede","Description":"Get bohemian style with a flair for the elegant in the wrapping, ankle tie and block heel design of Steve Madden's Rizza sandals.  Round open-toe ankle-strap dress sandals Wrapping ankle tie design 2\" block heel Suede upper; manmade sole Imported Web ID: 2900440 ","Image":"https://img.shopstyle-cdn.com/sim/4c/c6/4cc64ed3c317595daf466d28ac840ba5_medium/steve-madden-womens-rizza-lace-up-block-heel-sandals.jpg","Category":"Sandals"},{"Name":"Strappy Bandeau Bikini Top","Brand":{"id":"2661","name":"California Waves"},"Price":28,"Color":"Laser Blue","Description":"Push-up cups, underwire and strappy details: that's the perfection you'll find with California Waves' bandeau bikini top.  Soft push-up cups with underwire for support Model Measurements: Height (5’9\"); Bust (33-1/2”); Waist (24”); Hips (35”) Model is wearing Size M Strappy hook-and-loop at center back; removable halter strap Sweetheart neckline; ruched at center Nylon/spandex; lining: polyester Hand wash Imported Web ID: 3269962 ","Image":"https://img.shopstyle-cdn.com/sim/3a/d6/3ad68254283ee229ab6bd2ad581fa53a_medium/california-waves-strappy-bandeau-bikini-top.jpg","Category":"Teen Girls' Swimwear"},{"Name":"Printed Maxi Dress","Brand":{"id":"31658","name":"J.o.a."},"Price":105,"Color":"Yellow Multi","Description":"A flounced neckline and button-front styling define this stunning maxi dress from J.O.A.  Button closure at front Maxi length V-neckline with flounce detail Adjustable spaghetti straps; elastic detail at back Polyester; lining: polyester Hand wash Imported Web ID: 4682913 ","Image":"https://img.shopstyle-cdn.com/sim/6d/17/6d1780665407e578454fe40b9dc9ad2a_medium/j-o-a-printed-maxi-dress.jpg","Category":"Day Dresses"},{"Name":"Bell-Sleeve Sheath Dress","Brand":{"id":"103","name":"Calvin Klein"},"Price":134,"Color":"White","Description":"Voluminous bell sleeves balance the sleek fit of a Calvin Klein sheath dress while adding a trend-right touch.  Exposed back zipper Approximate model measurements: height: 5’10”, bust: 31-1/2”; waist: 24”; hips: 35” Hits at knee Boat neckline; sheath silhouette Three-quarter-length bell sleeves Polyester/spandex Dry clean Imported Web ID: 4382498 ","Image":"https://img.shopstyle-cdn.com/sim/25/6b/256bc63856c9922ea6f7f91f73aabefe_medium/calvin-klein-bell-sleeve-sheath-dress.jpg","Category":"Cocktail Dresses"},{"Name":"Classic Pencil Skirt, Only at Macy's","Brand":{"id":"20","name":"Alfani"},"Price":29.98,"Color":"Washed Teak","Description":"Always a classic, Alfani's essential pencil skirt puts the polish on every workweek outfit. The flattering shape works with every body, too!  Hidden back zipper closure Pencil silhouette Lined Slit at center back hem Hits at knee; approx. 22-3/4 inches long Only at Macy's Shell: polyester/rayon/spandex; Lining: polyester Machine washable Imported Web ID: 1792543 ","Image":"https://img.shopstyle-cdn.com/sim/30/39/3039f72d20c39963d942b339fa194a8e_medium/alfani-classic-pencil-skirt-only-at-macys.jpg","Category":"Mid-length Skirts"},{"Name":"Avec Les Filles Gemma Slide Bow Sandals","Price":128,"Color":"Silver Metallic","Description":"Flirt with fun in your day-to-day fashion with the Gemma sandals from Avec Les Filles, embellished with a charming oversized bow.  Round-toe sandals with oversized bow detail 1\" jute covered platform Leather upper; manmade sole Imported Web ID: 4464563 ","Image":"https://img.shopstyle-cdn.com/sim/94/4d/944d493583cdb1bbfcaabe7c8782a552_medium/avec-les-filles-gemma-slide-bow-sandals.jpg","Category":"Sandals"},{"Name":"Illuminator","Brand":{"id":"4096","name":"Anastasia Beverly Hills"},"Price":28,"Color":"So Hollywood","Description":"Like a filter for your complexion, this brush-on highlighter contains a mosaic of brightening powders that impart a lit-from-within glow. The mirrored compact makes on-the-go touchups easy and fail-safe. Available in four hues:  So Hollywood - A shimmery bronze hue that flatters deeper skin tones. Peach Nectar - A warm, rose gold that flatters light skin tones. Starlight - A sheer, luminescent white that flatters all skin tones. Riviera - A sun-kissed coppery hue that flatters medium to tan skin tones. Web ID: 2376777 ","Image":"https://img.shopstyle-cdn.com/sim/8e/b2/8eb2e31cd929f38385daea125051322f_medium/anastasia-beverly-hills-illuminator.jpg","Category":"Makeup"},{"Name":"Style & Co Clean Cut Reversible Crossbody, Only at Macy's","Brand":{"id":"558","name":"Style&Co."},"Price":78.5,"Color":"Shell/ Cork","Description":"Make room in your wardrobe for this clean-cut, minimalist must-have from Style & Co The reversible design carries day-to-day items in a roomier size that most other crossbodies and offers two versatile looks in one.  13\"W x 11-3/4\"H x 3-1/4\"D Interior features removable zip wristlet 24\"L adjustable crossbody strap Magnetic snap closure Exterior features silver-tone hardware Bag reverses easily by turning inside out and flipping the inside bottom panel. When reversed, seams turn inside with strap hooks on the outside. Silhouette is based off 5'9\" model Only at Macy's Faux leather Imported Web ID: 2884042 ","Image":"https://img.shopstyle-cdn.com/sim/92/f3/92f3220cc7a76255694171b96f7dd762_medium/style-co-style-co-clean-cut-reversible-crossbody-only-at-macys.jpg","Category":"Shoulder Bags"},{"Name":"Denim Sheath Dress","Brand":{"id":"103","name":"Calvin Klein"},"Price":89.98,"Color":"Blue","Description":"Dark denim-like fabric lends a laid-back and modern feel to this perfectly polished office dress from Calvin Klein.  Exposed back zip closure Approximate model measurements: height: 5’10”, bust: 31-1/2”; waist: 24”; hips: 35” Hits above knee Scoop neckline; sheath silhouette Back vent slit Polyester/rayon/spandex Dry clean Imported Web ID: 2873536 ","Image":"https://img.shopstyle-cdn.com/sim/cb/9e/cb9ef878daa6213d6a2a9f452c75aa5a_medium/calvin-klein-denim-sheath-dress.jpg","Category":"Day Dresses"},{"Name":"Freshly Squeezed Printed Top","Brand":{"id":"226","name":"Free People"},"Price":98,"Color":"Ivory","Description":"Boho-chic takes a turn in this Free People top, bold and vibrant with stylish, extra-long tie cuffs.  V-neckline; button closure at front Long sleeves with exaggerated tie detailing Cropped; hits above hip Rayon Machine washable Imported Web ID: 4682553 ","Image":"https://img.shopstyle-cdn.com/sim/da/f8/daf8070a2a491930661697b881a3d3a2_medium/free-people-freshly-squeezed-printed-top.jpg","Category":"Longsleeve Tops"},{"Name":"Gingham Belted Fit & Flare Dress","Brand":{"id":"424","name":"Nine West"},"Price":79,"Color":"Navy/White","Description":"A matching sash belt cinches the flirty waistline of Nine West fit & flare sundress styled in season-right gingham.  Hidden back zipper with hook-and-eye closure Knee length Scoop neckline; fit & flare silhouette Scoop back; pleated skirt; removable sash belt at waist Shell: cotton/polyester; lining: polyester Dry clean Imported Web ID: 4689016 ","Image":"https://img.shopstyle-cdn.com/sim/3a/f4/3af4cd0c37179102e034dfcdc7c1f4ff_medium/nine-west-gingham-belted-fit-flare-dress.jpg","Category":"Day Dresses"},{"Name":"Lights, Camera, Flashes Statement Mascara","Brand":{"id":"2090","name":"Tarte"},"Price":23,"Color":"black","Description":"Take your sultry, flashy lashes to the extreme with this amped up, ultra-black mascara that lengthens, curls and magnifies lashes for an intensified look proven to increase lash volume by 752% instantly! Powered by tarte's proprietary triple black complex, this longwear, vitamin-infused formula emphasizes length and volume while conditioning lashes for a dramatic look that won't dry out, flake or budge. Product Perfomance: The custom-engineered, dual-molded 360° volu-flex brush converts even the skinniest lashes into an exaggerated fringe: first, the short, dense, soft-flex bristles deliver the optimal amount of mascara to coat each lash perfectly, then the longer firma-flex bristles lengthen and separate for maximum volume without clumping. Powered by provitamin B5. Vitamin B derivative that helps treat and thicken lashes. Beeswax creates a protective barrier between the skin and the environment that has been known to naturally stimulate collagen production. Mineral pigments soothe and soften lashes.  Always formulated without parabens, mineral oil, phthalates, triclosan, sodium lauryl sulfate, and gluten. Dermatologist tested. Web ID: 972015 ","Image":"https://img.shopstyle-cdn.com/sim/65/1e/651ecd4e966e588c6d5ef9793de747da_medium/tarte-lights-camera-flashes-statement-mascara.jpg","Category":"Mascara"},{"Name":"hoola matte box o' powder travel-size bronzer mini","Brand":{"id":"33215","name":"Benefit Cosmetics"},"Price":15,"Color":"black","Description":"WHAT IS IT: An award-winning matte bronzing powder for face in a purse friendly travel mini size. WHAT IT DOES: Fake it till you make it with Benefit Cosmetics' award-winning hoola matte bronzing powder travel size mini! Dust this super portable prestige bronzer over your chin, cheeks, and forehead for a natural-looking glow all year round. Perfect for all skintones, this iconic matte bronzing powder leaves a pure matte color and comes with a soft, natural-bristle cheek brush for easy on-the-go application. Its buildable formula leaves a healthy glow without sparkle or shine and delivers seamless application that lasts.  Hoola is the #1 best-selling Prestige Bronzer in the US* *Source: The NPD Group, Inc. / BeautyTrends®, January 2015 - June 2015 Prestige Item US Dollar Sales. HOW TO APPLY: The secret is out! Hoola matte bronzer is every makeup artist's secret weapon for contouring, sculpting, and defining features. Apply hoola & watt's up! together for a perfect contouring duo. Always remember to avoid applying too much color. Web ID: 2693579 ","Image":"https://img.shopstyle-cdn.com/sim/e0/b4/e0b4e1adf25743cde79ede33bbf5bf64_medium/benefit-cosmetics-hoola-matte-box-o-powder-travel-size-bronzer-mini.jpg","Category":"Face Bronzer"},{"Name":"Linen Cold-Shoulder Flounce Top","Brand":{"id":"366","name":"Lucky Brand"},"Price":79.5,"Color":"Blue Multi","Description":"Understatedly chic and flattering, this lightweight linen top from Lucky Brand showcases a sweet flounce at the neckline and modern cold-shoulder styling.  Straight neckline; button closure at front; ties at straps Flounce at chest; cold-shoulder styling Hits at hip All linen Machine washable Imported Web ID: 4682255 ","Image":"https://img.shopstyle-cdn.com/sim/07/b3/07b336e3cb7e9db445430dc3197841c3_medium/lucky-brand-linen-cold-shoulder-flounce-top.jpg","Category":"Shortsleeve Tops"},{"Name":"Style & Co Layered-Look Peplum T-Shirt, Only at Macy's","Brand":{"id":"558","name":"Style&Co."},"Price":34.5,"Color":"Orchid Oasis","Description":"This layered look from Style & Co combines a cropped T-shirt with a chiffon peplum hem. Pair it with dark-wash skinny jeans and classic tennis shoes.  Scoop neckline Approximate model measurements: height: 5'10\"; bust: 35.5\"; waist: 27\"; hips: 35\" Short sleeves Knit body; contrast woven layer at bottom Easy fit Unlined Peplum hem Hits at hip Generous sizing, if in-between sizes, consider sizing down Only at Macy's Cotton; hem: rayon Machine washable Imported Web ID: 2539168 ","Image":"https://img.shopstyle-cdn.com/sim/d4/d8/d4d86e4f73583319305c0c3cac594cb2_medium/style-co-style-co-layered-look-peplum-t-shirt-only-at-macys.jpg","Category":"Tees"},{"Name":"Caselle Small Basket Bag","Brand":{"id":"31949","name":"Patricia Nash"},"Price":149,"Color":"Cuban Tropical Black","Description":"Patricia Nash's basket bag in wicker and fine leather offers season after season of eye-catching style.  Wicker: rattan/leather; trim: leather; scarf: viscose Small sized bag; 10-1/4\"W x 7-1/4\"H x 6\"D Silhouette is based off 5'9\" model 7\"L handle Twist-lock tab closure Signature antique copper-tone exterior hardware; removable scarf 1 interior zip pocket & 2 slip pockets Imported Web ID: 4564956 ","Image":"https://img.shopstyle-cdn.com/sim/15/9d/159d8681ded23bbaa59a3bdbc0a49d5d_medium/patricia-nash-caselle-small-basket-bag.jpg","Category":"Satchels"},{"Name":"Amazonian Clay Waterproof Bronzer","Brand":{"id":"2090","name":"Tarte"},"Price":30,"Color":"park ave princess","Description":"A longwearing mineral-based bronzing powder infused with Amazonian clay for a healthy, natural looking glow. Product Performance: This fragrance free bronzer delivers sunkissed radiance in a lightweight finish without clogging your pores. It blends and builds effortlessly to your desired level of natural-looking bronze and its high sheen compact is perfect for achieving an on-the-go glow. Powered by Amazonian clay, nature's most perfect ingredient acts as a total skin balancer by reducing dryness and flakiness, improving clarity and texture, and removing surface oil for a true Brazillian bronze bombshell finish.  Always formulated without parabens, mineral oil, phthalates, triclosan, sodium lauryl sulfate, and gluten. Dermatologist tested. Web ID: 971993 ","Image":"https://img.shopstyle-cdn.com/sim/66/bf/66bf5e7f14a726e5e00b6ea7e6dbe5f8_medium/tarte-amazonian-clay-waterproof-bronzer.jpg","Category":"Makeup"},{"Name":"the POREfessional agent zero shine - shine vanishing pro powder","Brand":{"id":"33215","name":"Benefit Cosmetics"},"Price":30,"Color":"park ave princess","Description":"WHY WE LOVE IT: Operation shine control! The POREfessional: agent zero shine instantly minimizes shine and helps smooth the look of pores. Our invisible shine-control powder joins you in your top secret mission for smoother-than-smooth skin. Pores and shine don't stand a chance! Just twist, tap & sweep to look fresh-faced, without a trace!  HOW TO APPLY: Twist off built-in brush from base. Then tap powder into lid and dip brush. Sweep on moisturized skin or over makeup to instantly mattify your complexion. Touch up over makeup during the day...or whenever shine dares to return. Web ID: 1213760 ","Image":"https://img.shopstyle-cdn.com/sim/6b/0e/6b0e17ef15f4aaf07b556311dd7bc951_medium/benefit-cosmetics-the-porefessional-agent-zero-shine-shine-vanishing-pro-powder.jpg","Category":"Face Makeup"},{"Name":"Peach Illuminating Cheek Palette - Havana Brights Collection","Brand":{"id":"834","name":"Bobbi Brown"},"Price":50,"Color":"Peach","Description":"Mimic the sexy glow of cheeks after a day in the Caribbean sun or a night on the dance floor with Bobbi's all-new bronzer, blush and highlighter trios. Layered together, they create the perfect, natural-looking flush of color with a sultry hint of shimmer. Inspired by Bobbi's signature cheek technique, the shades in this palette are designed to be layered for a look that's natural and long-lasting. Start with the neutral shade, add a touch of the bright shade, then finish with the subtly shimmery shade to highlight the face.  Peach palette is ideal for light to medium skin tones Guava palette is best for medium to rich skin tones How to use: Using a Face Blender Brush, apply neutral shade starting on the apples of cheeks, blending up towards the hairline and down to soften color Add the pop shade just on the apples of cheeks, followed by a light dusting of highlighter to illuminate the skin Web ID: 4538078 ","Image":"https://img.shopstyle-cdn.com/sim/f7/56/f756b370b6e4cfc34e2d6bbeae5ecafe_medium/bobbi-brown-peach-illuminating-cheek-palette-havana-brights-collection.jpg","Category":"Face Blush"},{"Name":"Women's Stecy Two-Piece Sandals","Brand":{"id":"552","name":"Steve Madden"},"Price":79.98,"Color":"Rose Gold","Description":"A chic, barely-there silhouette will make your look come alive. The Stecy two-piece sandals by Steve Madden.  Fabric contents and colors include: Leather in black or natural Manmade in rose gold Round open-toe dress sandals with ankle strap and leather lining Padded for added comfort 3-3/4\" heel Leather or manmade upper; lining: leather; manmade sole Imported Web ID: 1853393 ","Image":"https://img.shopstyle-cdn.com/sim/05/6e/056e2108d087995743995f87a8fae7ba_medium/steve-madden-womens-stecy-two-piece-sandals.jpg","Category":"Sandals"},{"Name":"Contour Cream Kit","Brand":{"id":"4096","name":"Anastasia Beverly Hills"},"Price":40,"Color":"NEW! Medium","Description":"Blendable cream goes on smooth. Opaque coverage adds the perfect shadow and highlights. Available for Fair, Light, Medium, and Deep Skin Shades. Some shades act as ideal correctors for skin discoloration. Contouring and highlighting creams to dramatically sculpt and enhance your features. Creams have a rich, blendable texture ideal for heavy highlight and contour.  Kits available in 4 shades:Fair, Light, Medium, and Deep. Web ID: 1965759 ","Image":"https://img.shopstyle-cdn.com/sim/d6/6b/d66b896b287495553a2c43673b8badf7_medium/anastasia-beverly-hills-contour-cream-kit.jpg","Category":"Makeup"},{"Name":"V-Neck Crop Top, Only at Macy's","Brand":{"id":"1868","name":"Rachel Roy"},"Price":79,"Color":"White","Description":"This versatile crop top by RACHEL Rachel Roy pairs perfectly with anything from jeans to pencil skirts.  V-neckline Pullover style Hits at hips Viscose/nylon Machine washable Imported Web ID: 4836638 ","Image":"https://img.shopstyle-cdn.com/sim/ca/8c/ca8cc08c54882ac6f4d82588792a372b_medium/rachel-roy-v-neck-crop-top-only-at-macys.jpg","Category":"Sleeveless Tops"},{"Name":"Grace Elements Cotton Off-The-Shoulder Midi Dress","Price":90,"Color":"White","Description":"Make romance an essential part of your style with Grace Elements' off-the-shoulder peasant dress.  Pullover styling Hits at mid-calf Straight neckline ruffled overlay; A-line silhouette Short sleeves; off-the-shoulder design Elastic at empire waist; removable self-tie belt Cotton; lining: cotton Machine washable Imported Web ID: 4471592 ","Image":"https://img.shopstyle-cdn.com/sim/3a/4d/3a4d06d781cba1c6da79fe4312f45c20_medium/grace-elements-cotton-off-the-shoulder-midi-dress.jpg","Category":"Day Dresses"},{"Name":"Crave Fame Juniors' Lace-Trim Off-The-Shoulder Top","Brand":{"id":"32040","name":"Almost Famous"},"Price":34,"Color":"White","Description":"Make your fashion statement in Crave Fame's off-the-shoulder peasant top, styled with bell sleeves and lace trim.  Elasticized off-the-shoulder neckline Pullover style Long bell sleeves; adjustable shoulder straps Lace trim Easy fit Hits at hip Rayon Machine washable Imported Web ID: 4547402 ","Image":"https://img.shopstyle-cdn.com/sim/6f/a9/6fa9e39fb1ec32d9bf9f3ce6a6820780_medium/almost-famous-crave-fame-juniors-lace-trim-off-the-shoulder-top.jpg","Category":"Teen Girls' Tops"},{"Name":"Beach Bum Metallic-Detail Jumpsuit","Brand":{"id":"226","name":"Free People"},"Price":168,"Color":"Ivory","Description":"Metallic stripes offer shimmery contrast against an effortless silhouette. An extra wide-leg fit and beaded tassels add boho-chic appeal to this fabulous jumpsuit from Free People.  Ruffled split neckline; embellished tassels Pull-on style Metallic detailing; tiered styling Relaxed fit through hips and thighs Wide leg Approx. inseam: 27-1/2\" Cotton/metallic threading Hand wash Imported Web ID: 4650102 ","Image":"https://img.shopstyle-cdn.com/sim/9b/f5/9bf5e6eedd1ae50d7b5870c1b0e94f00_medium/free-people-beach-bum-metallic-detail-jumpsuit.jpg","Category":"Wide Leg Pants"},{"Name":"Gold-Tone Glitter Square Stud Earrings","Brand":{"id":"316","name":"Kate Spade"},"Price":38,"Color":"Red","Description":"Make an ordinary day extraordinary with these fun yet sophisticated glitter square stud earrings designed by kate spade new york in 14k gold-plated metal. Approximate diameter: 1/2\". Packaged in a lovely gift box.  Web ID: 2968981 ","Image":"https://img.shopstyle-cdn.com/sim/2a/8d/2a8d1bf7d9d72489b9995822c4300e77_medium/kate-spade-gold-tone-glitter-square-stud-earrings.jpg","Category":"Earrings"},{"Name":"Cap-Sleeve Textured Sheath Dress","Brand":{"id":"1957","name":"Sangria"},"Price":79,"Color":"White","Description":"An array of unique textures beautifully sculpts the figure on this cap-sleeve sheath dress from Sangria.  Hidden back zipper Knee length Scoop neckline; sheath silhouette Cap sleeves Allover texture Polyester/spandex; lining: polyester Machine washable Imported Web ID: 4493674 ","Image":"https://img.shopstyle-cdn.com/sim/e1/5a/e15a31ef544ef2acab24eb6bc1a1f790_medium/sangria-cap-sleeve-textured-sheath-dress.jpg","Category":"Dresses"},{"Name":"Women's Florent Flats","Brand":{"id":"366","name":"Lucky Brand"},"Price":79,"Color":"Glazed","Description":"Lucky Brand's Florent flats are a subtle mule with sensible height fashioned with a single wide strap and effortless slip-on design.  Round-toe slip-on mule sandals 1\" heel Leather upper; manmade sole Imported Web ID: 4617107 ","Image":"https://img.shopstyle-cdn.com/sim/be/70/be707f6083a21aed143b4186a52a9f2e_medium/lucky-brand-womens-florent-flats.jpg","Category":"Sandals"},{"Name":"Ranata Lace-Up Block-Heel Sandals","Brand":{"id":"616","name":"Vince Camuto"},"Price":129,"Color":"Smoke Show","Description":"Vince Camuto has a sassy lace-up look with a sought-after block heel in the Ranata sandals.  Round-toe sandals with side zipper Strappy upper with lace-up detail; tassel detail at side 3-3/4\" stacked heel Leather upper; manmade sole Imported Web ID: 4454213 ","Image":"https://img.shopstyle-cdn.com/sim/fe/f5/fef5c305a137e5898fbfdcf102a5c907_medium/vince-camuto-ranata-lace-up-block-heel-sandals.jpg","Category":"Sandals"},{"Name":"Ivee Block-Heel Sandals","Brand":{"id":"75","name":"Betsey Johnson"},"Price":59,"Color":"Navy","Description":"Betsey Johnson's Ivee sandals with slender ankle strap detail are a quaint, casual look with feminine flair that will spice up your look any day.  Round-toe sandals with ankle strap and buckle closure; knot detail at toe 2\" covered block heel Fabric upper; manmade sole Imported Web ID: 4820168 ","Image":"https://img.shopstyle-cdn.com/sim/be/83/be83d2e436dcda09fee10789623bfdc7_medium/betsey-johnson-ivee-block-heel-sandals.jpg","Category":"Sandals"},{"Name":"Fame and Partners Floral-Print Wrap Maxi Dress","Price":279,"Color":"Pastel Bloom","Description":"A pastel floral print sets this matte satin wrap dress from Fame and Partners apart. Featuring delicate bows at the shoulders and a defined waistline, it transitions easily between day and night.  Hidden nylon zipper with hook-and-eye closure Model Measurements: Height: 5'11\"/180 cm Long length Surplice neckline with ruffle Thin straps with shoulder ties Surplice back with ruffle; tie at waistline IMPORTANT Shell and lining: polyester matte satin Dry clean Imported Web ID: 4750986 ","Image":"https://img.shopstyle-cdn.com/sim/bb/44/bb449018cc8430affbfc78d2b8a2a8a5_medium/fame-and-partners-floral-print-wrap-maxi-dress.jpg","Category":"Evening Dresses"},{"Name":"Wild Poppies Floral-Print Shift Dress","Brand":{"id":"14892","name":"Kensie"},"Price":89,"Color":"Hot Lava Combo","Description":"A contemporary silhouette meets sweet classic details in this kensie sheath dress. Vintage-inspired floral print comes together with lovely lace shoulders.  Keyhole and button closure at back of neckline Hits at thigh Crew neckline; shift silhouette Lace panels at shoulders; floral print Polyester/spandex; Lining: polyester Hand wash Imported Web ID: 4565050 ","Image":"https://img.shopstyle-cdn.com/sim/fa/ce/faced945816b53473f866c1688f85a9c_medium/kensie-wild-poppies-floral-print-shift-dress.jpg","Category":"Day Dresses"},{"Name":"Notched-Collar One-Button Blazer","Brand":{"id":"14892","name":"Kensie"},"Price":89,"Color":"Bright Purple","Description":"You'll be ready for your workday when you slip on this one-button blazer from kensie.  Notched collar Front one-button closure Long sleeves Faux pockets at front Lined Hits at hip Polyester/rayon/spandex; lining: polyester Dry clean Imported Web ID: 4836402 ","Image":"https://img.shopstyle-cdn.com/sim/3e/55/3e553e58f437e158f5aa7b2e3e7dba3f_medium/kensie-notched-collar-one-button-blazer.jpg","Category":"Blazers"},{"Name":"Soft & Relaxed Cutoff Denim Shorts","Brand":{"id":"226","name":"Free People"},"Price":68,"Color":"White","Description":"Show off in a pair of trendy cutoff shorts by Free People.  High rise; straight fit through hips and thighs Approx. inseam: 2\" Zipper and button closure at front; belt loops Five-pocket styling Frayed hem Cotton Machine washable Imported Web ID: 4374929 ","Image":"https://img.shopstyle-cdn.com/sim/2b/14/2b1467ba4b24c7cb18f1cc0734d9444c_medium/free-people-soft-relaxed-cutoff-denim-shorts.jpg","Category":"Shorts"},{"Name":"Nail Color, Fiji","Brand":{"id":"4187","name":"Essie"},"Price":9,"Color":"fiji","Description":"An opaque creamy pale pink.  This product will be delivered by Standard Ground Shipping and is not eligible for Premium or Overnight Shipping. Web ID: 581835 ","Image":"https://img.shopstyle-cdn.com/sim/49/50/495004ca4a4593314ca0d475d8ff6cae_medium/essie-nail-color-fiji.jpg","Category":"Nail Polish"},{"Name":"Tommy Script Mini Crossbody","Brand":{"id":"585","name":"Tommy Hilfiger"},"Price":88,"Color":"Natural","Description":"Embrace the retro-sporty style of a Tommy Hilfiger mini backpack silhouette suspended from a crossbody strap and emblazoned with a script logo for an eye-catching look.  Mini sized bag; 6-1/2\"W x 8-1/4\"H x 3-3/8\"D Interior features 1 zip pocket and 1 slip pocket 1-1/2\"L top handle; 23-1/2\"L strap Zip closure Exterior features gold-tone brass hardware and logo script Silhouette is based off 5'9\" model Canvas; trim: faux leather Imported Web ID: 4342709 ","Image":"https://img.shopstyle-cdn.com/sim/67/53/67535fb2779df8266160d057415b85e9_medium/tommy-hilfiger-tommy-script-mini-crossbody.jpg","Category":"Shoulder Bags"},{"Name":"Under the Sea Scalloped-Edge Textured One-Piece Swimsuit","Brand":{"id":"292","name":"Jessica Simpson"},"Price":98,"Color":"White","Description":"A classic one-piece gets a fresh look with the scalloped trim and textured fabric of this Jessica Simpson swimsuit.  V-neckline Pull-on styling; ties at back neck and back Removable soft cups; elastic below bust Scalloped edge at bust Gold-tone hardware at strings One-piece swimsuit Lined Full bottom coverage Nylon/spandex; lining: polyester Hand wash Imported Web ID: 2878908 ","Image":"https://img.shopstyle-cdn.com/sim/eb/e7/ebe7e11d36e41e18e8a3040e5baa0487_medium/jessica-simpson-under-the-sea-scalloped-edge-textured-one-piece-swimsuit.jpg","Category":"Teen Girls' Swimwear"},{"Name":"Women's Santi Strappy Sandals","Brand":{"id":"552","name":"Steve Madden"},"Price":109,"Color":"Yellow Nubuck","Description":"Steve Madden's Santi sandals merge a jaw-dropping stiletto heel with an ultra-strappy design that wraps up your look in scene-stealing sophistication.  Nubuck leather in yellow or camel Almond-toe strappy dress sandals Zipper closure at back Padded for added comfort 4-1/4\" wrapped stiletto heel Nubuck leather upper; manmade sole Imported Web ID: 4897127 ","Image":"https://img.shopstyle-cdn.com/sim/11/51/115128f67934362ddf72358f40043e09_medium/steve-madden-womens-santi-strappy-sandals.jpg","Category":"Sandals"},{"Name":"Women's Tubular Shadow Casual Sneakers from Finish Line","Brand":{"id":"14","name":"adidas"},"Price":99.99,"Color":"WHITE/PEARL GREY/CORAL","Description":"The adidas Tubular Shadow Casual Sneakers push the boundary on style like never before. Boasting a super light and breathable melange knit upper for all-day comfort. An all-new \"burrito\" tongue adds a supportive fit while rope laces add an extra touch of class to this stylish model.  Melange knit upper with 3D diamond pattern Textile lining \"Burrito\" tongue for supportive fit EVA midsole for lightweight cushioning Style no. BB8872 Women's athletic footwear from Finish Line Synthetic upper; rubber sole Imported Web ID: 4590682 ","Image":"https://img.shopstyle-cdn.com/sim/42/01/4201a9453718683cc9361294890d0350_medium/adidas-womens-tubular-shadow-casual-sneakers-from-finish-line.jpg","Category":"Sneakers"},{"Name":"Embroidered & Striped Cotton Shirt, Only at Macy's","Brand":{"id":"119","name":"Charter Club"},"Price":69.5,"Color":"Classic Blue","Description":"Lush embroidered florals provide a feminine balance to crisp stripes on this classic button-front cotton shirt from Charter Club.  Point collar; button closures at front Approximate model measurements: height: 5'10\"; bust: 35.5\"; waist: 27\"; hips: 35\" Floral embroidery at front Long sleeves roll to 3/4 sleeves with roll tabs Fitted; hits at hip Only at Macy's All cotton Machine washable Imported Web ID: 4695777 ","Image":"https://img.shopstyle-cdn.com/sim/7b/bf/7bbfcafb56bf1a7644916e882a31f68d_medium/charter-club-embroidered-striped-cotton-shirt-only-at-macys.jpg","Category":"Longsleeve Tops"}]